[{"text":"makin parah ini game sering koneksi tidak stabil,jadi tidak bisa menikmati permainan akibat koneksi yg selalu menjadi permasalahan di dalam game ini.dan tampaknya team support game ini cuek akan hal ini.","sentiment":"negatif","predict":"negatif"},{"text":"Match making nya ampas ktemu kawan yg match nya di bwah 100 alias masih puluhan.ya kali main nya bgus gkpp ini malah kek bot. ngasih musuh nya malah ga ngotak main nya dan tolong perbaiki masalah sinyal yg naik trun pas lgi di game, pas main game lain lancar aja pas main ml malah naik turun sangat membuat player tidak nyaman dan resah semoga segera di perbaiki","sentiment":"negatif","predict":"negatif"},{"text":"ini sistem moonton benar\" parah sih dark system nya ganggu banget, dapat team yang pada ga bisa main, sedangkan musuh nya pada jago-jago banget, sangat menggangu untuk kesenangan doang, sangat payah, ga layak sistem nyaa","sentiment":"positif","predict":"negatif"},{"text":"Dark sistem nya tolong di hilangkan ,buat kesal saja ,selalu dpt tim tolol yg suka troll , dan ketika mau ngelord ,ngekill , dan push turet selalu ada saja lag nya sehingga lawan mudah membalikkan keadaan,padahal spek hp tinggi.. mlbb menang sama kalah nya seperti sudah di atur. Kalau seperti ini mohon maaf lebih banyak game yang menyenangkan lain nya ,lebih baik saya hapus mlbb. Dan seperti nya game ini popularitas nya semakin menurun ,bisa jadi 2 atau 3 tahun lagi sudah tidak populer.","sentiment":"negatif","predict":"negatif"},{"text":"Perbaiki jaringan nya dulu sinyalnya dari hijau langsung ke merah kaga tau knp ml pas update barusan jadi ngelag sinyalnya makin parah, klo mau update harus lebih di up smua jangan di up grafis ataupun hero tapi jaringan nya jadi sangat buruk. Mohon perhatian nya moonton jangan sampe game ini gak diminati lagi","sentiment":"negatif","predict":"negatif"},{"text":"Moonton hapus dark system lu kalo lu ga mau game lu mati, jaringan tiba tiba lag terus pas dah mati baru lag nya selesai, gua dapet tim yg ga ngerti main mulu, tapi, musuh nya jago semua, kalo gua kalah sekali lagi gua hapus nihh mobile legend","sentiment":"negatif","predict":"negatif"},{"text":"Sumpah ini penyeimbangan tim nya terlalu jauh ,masa iya kita rank tinggi dpt tim yg rank nya minus mainnya jelek pliz ini game bkin kalian tolol saya sendiri adalah korbannya, saya sudah berusaha berkali² untuk menang malah ketemu tim yg tidak jelas mainnya ......hanya sekedar mengingatkan suatu saat kalian menyesal download game inj","sentiment":"negatif","predict":"negatif"},{"text":"Pengalaman bermain dari 2018 sudah selesai, semakin kesini sudah tidak enak untuk dimainkan, sistem matchmaking aneh, tim serasa pemula semua dan lawan seperti pro semua alhasil losetreak terus sangat susah untuk mendapatkan kemenangan seperti ada darksystem ataupun sudah diatur dari sana, sangat disayangkan sekali ,, padahal saat tahun 2018-2020 atau 2021 masih sangat enak dimainkan dan seperti nya masih seimbang untuk 5v5 nya, terimakasih sudah menghibur selama ini.","sentiment":"netral","predict":"negatif"},{"text":"Sekedar memberi kan saran kalau matchmaking yg masuk akal moonton tim maupun lawannya terkadang lawan yg terlalu kuat dan tim yg tidak memiliki skill yg setara tolong moonton masuk akal sedikit bukan berarti matchmaking itu buat kita cepat menemukan lawan tetapi harus diperhatikan juga skill,rank,maupun kapan mereka bermain mobile legend walau matchmaking lama tpi tim dan lawan berada di level yg setara itu malah menjadi lebih baik saya berharap","sentiment":"netral","predict":"negatif"},{"text":"Hallo Monton Saya ingin memberikan pendapat saya tentang update emblem dan update lainnya,update Yang sekarang itu jelek sekali soalnya kabel Fanny jadi delay,sinya sebenarnya bagus² saja namun malah lag di in game tolong perbaiki masalah delay dan lag itu! Terima kasih telah membaca dan meluangkan waktu untuk membacanya","sentiment":"negatif","predict":"negatif"},{"text":"Kagak jelas bangat, lagi main tiba tiba ngeframe sinyal padahal bagus, eh malah keluar sendiri, update yang bermanfaat dikit napan, nambah skin doang. Untuk hp yang kentang malah tersiksa","sentiment":"positif","predict":"negatif"},{"text":"Keluh kesah nya di sinyal kenapa pas lagi war tiba\" sinyal merah pas di pencet di siaran sinyal nya warna hijau. Untuk emblem yang sudah di Revamp ini menyulitkan sekali saya tidak paham gimana cara setting nya. Plus lah montod apalagi kalo dapet tim masa pas solo dapet tim nya gak bener tim lawan malah jago\" tim kita lemah klemer\" plis deh monton di perbaiki lagi saran saya untuk emblem nya tidak usah di Revamp lebih baik emblem yang dulu","sentiment":"netral","predict":"negatif"},{"text":"Tidak ada opsi pengaduan saat jaringan buruk, jaringan buruk yang di salahkan pemain hingga afk sangat tidak Fair. Pemain dirugikan.","sentiment":"positif","predict":"negatif"},{"text":"I,m sorry moonton gw kasih bintang 1 karena game nya ampas banget 1).matmacking ga seimbang masa gw masih myhtic ketemu mantan mythic immortal kan ga fair mohon perbaiki lagi masalah matmacking nyaa... 2) terlalu banyak bug,masa sinyal gw bagus malah balik ke lobby lagii.. 3) sangat tidak ramah game nya banyak banyak player toxic yg menggangu kenyamanan bermainn... Sekian terima kasih...","sentiment":"negatif","predict":"negatif"},{"text":"Maaf ya Moonton,tolong diperbaiki lagi kaya dulu,dulu matchmaking nya seimbang,sekarang malah berat sebelah,musuh nya sering pake cheat,mohon developer untuk perbaiki matchmaking nya agar seimbang,terus saya sering mengalami bug,padahal sinyal bagus,mohon perbaiki....","sentiment":"netral","predict":"negatif"},{"text":"pada dasar nya geme ini hanya untuk orang yg jago main, draf pick yg ketemu nya perbedaan rank yg jauh atau beda pangkat sangat mempengaruhi kenyamanan bermain. MOHON DI BACA DAN PERBAIKI KARENA SANGAT MERUGIKAN BAGI YG BARU MAIN!!.","sentiment":"negatif","predict":"negatif"},{"text":"Saya sudah tidak menemukan kesenangan bermain game ini, yang saya dapat hanyalah emosi dan rasa kesal di season ini. Saya bermain dari season 3 dan season 28 ini sistem mactmakin terburuk yang pernah saya rasakan. Sangat2 buruk untuk para solo player.","sentiment":"negatif","predict":"negatif"},{"text":"Permasalahan match mackingnya tidak pernah di perbaiki, setiap bermain selalu tidak di perseimbangkan, musuh jago tim sendiri bodoh itupun bukan hanya sekali duakali tapi lebih 5kali berturut turut","sentiment":"netral","predict":"netral"},{"text":"Aku suka banget main mobile legend yah. Game nya bagus tapi kenapa kok di kao main solo itu sering banget ketemu tim musuh yang hebat, sedangkan tim saya itu G0bl0k semua. Jadi pesan saya untuk moonton seimbang kan player nya. Kalo musuhnya gg ya kasih aku tim yg gg juga lh. Pliss moonton tindak lanjuti player yg mainnya gak bagus. Kalo udah diperbaiki saya kasih bintang 5👍terima kasih","sentiment":"negatif","predict":"negatif"},{"text":"Makin ke sini makin parah , Tolong perbaiki soal jaringan, jangan cuman bikin Hero baru saja, Semenjak update , maen jadi ga nyaman, lag terus, pingnya ga stabil. padahal sinyal wifi sama provider nya bagus, tp ketika maen sering lag, padahal pakai hp ram 8 Rom 128 kan aneh .","sentiment":"netral","predict":"netral"},{"text":"Bye bye moonton karena saya sudah ga menikmati permainan ini lagi dikarenakan jaringan jelek mulu padahal sinyal di rumah bagus tapi lag mulu daripada pusing mending saya un instal padahal saya bermain sudah lama tapi makin kesini makin jelek permainannya","sentiment":"netral","predict":"negatif"},{"text":"Hal yang paling saya benci dari game ini adalah, ketika saya masuk ke loby lalu tiba tiba kepencet mulai permainan, dan setelah itu mencari pertandingan nya gak bisa dibatalkan, ini adalah salah satu hal yang paling saya benci, dan jika tidak masuk ke pertandingan maka akan kehilangan kredit skor.","sentiment":"negatif","predict":"negatif"},{"text":"Menurut saya game ini suka buat emosi orang terutama gw gw main ml kalah mulu sering di kasih tim yang tidak seimbang game ini merusak otak pikiran dan hidup gw njirr kalo gw terusin main game ini bisa jadi gila gw gara gara main game ini menurut saya mending main ff minecraft stumble dll dari pada game ga guna ini kalo mau naik mythic pun susah banget memang pas awal main gampang tapi lama kelamaan lu pasti sering ngerasain kalah mulu sebaik nya jangan download game merusak hidup lo nanti","sentiment":"negatif","predict":"negatif"},{"text":"BUG BNRN DLU BARU UPDATE! saya main classic nge stack persenan nya. saya tggu 5 menit gda perubahan, wifi sdh bagus, sy gnti make data jg sama, data jg masi byk. dr kmrn begini trus. kredit skor sya sampe turun drastis, bagaimana mau main kalau begini terus!? gajelas. perbaiki dlu game nya baru update besar besaran.","sentiment":"positif","predict":"negatif"},{"text":"makin aneh, update nya udah di di keluhkan lewat game, sama ajah gada perubahan, dlu sih menyenangkan, maaf min benerin sistem matching biar seimbang, nemu tim yg baru pertandingan puluhan haduh, giliran musuhnya pada ber otak semua, 🗿","sentiment":"negatif","predict":"negatif"},{"text":"Tolong di perbaiki masalah atau bug pada jaringan , sebelum main test jaringan ping masi aman kenapa di in game nya ping nya loncat loncat , kenapa setelah update malah banyak bug gini tolong diperbaiki lah biar main juga makin nyaman.","sentiment":"negatif","predict":"negatif"},{"text":"Mohon maaf ini moonton, tapi game ini semakin update bukannya semakin optimal tapi malah makin berat, dulu Smartphone saya bisa main game ini dengan lancar, tapi sekarang sudah patah2, Terutama pada efek skin hero2 mobile legends.","sentiment":"negatif","predict":"negatif"},{"text":"Mohon playernya di filter lagi, supaya komposisi tim imbang, player dengan match ribuan dimainkan secara bersama. Player match puluhan bersama. Yang paling PENTING, user: L M A O adalah player toxic, tidak beradab, membawa bawa keluarga (bapak), kalau masih belum ada tanggapan, saya akan tetap kasih rating star 1.","sentiment":"netral","predict":"negatif"},{"text":"Moonton lu ngotak ga si? Jaringan ku udah bagus tapi dibilang jaringan tidak stabil lu ngotak ga sih ha?. Udah jaringan bagus kouta masih banyak tapi bilang jaringan tidak stabil. Moonton rusaakkk","sentiment":"netral","predict":"negatif"},{"text":"Woy monton tolong lah jangan update terus kasian HP yang ram 2gb jadi gak bisa main mobile legend lagi sekarang mobile legend sudah mencapai 8gb lho jangan di update terus, sama kalau kasih tim itu yang sama rata sama musuhnya kadang musuhnya jago tim saya pada gak bisa main, kondisi mobile legend sekarang sudah tidak membaik gara gara ada player new, dulu pas masa player old pada jago dan tidak mandang skin tolong monton kasih tim yang bener yang pada gak bisa main baned aja biar gak bebani tim","sentiment":"positif","predict":"negatif"},{"text":"Aneh sama ml cuman anehnya sama masalah ganti akun doang segala ada bacaan kek gini Akun dari platform sosial ini tidak terkait dengan game. Tidak dapat beralih. Silahkan coba lagi Jadi males gua maen ml padahal gua udh coba pake cara di google play gua ganti semua ttp aja ga bisa pake akun yg gua ingin pake ml anehh mohon di perbaiki masalah untuk login kalau masalah login mah bebas aja jadi ribet pake cara apa bae jadi males maen gua pensi ml ah dah cape","sentiment":"negatif","predict":"negatif"},{"text":"Tolong, pihak developer, semenjak update makin banyak keresahan!!!!!, saya masuk login, malah disuruh dowload data lagi, padahal saya sudah ful, dan pada pertandingan malah game nya ngeframe, padahal game yang lain lancar aja, kayak pubg, ml malah bikin aneh, ga bisa ngatur update, makin jelek, makin parah, makin ga seru, mending ga ush update, kalau banyak bug- bug mulu kek apa coba?!!!!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Kurang memuaskan, Match nya seimbangin dong, yang bener aja gw lose streak 15 kali. Abis upgrade bukannya makin bagus malah biasa saja. Saya udah main bener\" tim nya ga bener, gw low tier di kasih musuh high tier gimana sih","sentiment":"positif","predict":"negatif"},{"text":"Saya kecewa dengan game ini, ukuran game nya semakin besar dan mulai tidak supprot di hp ram 2\/32gb, saya kecewa sekali saya telah main game ini dari 2019 dan sistem rank yg buruk👎","sentiment":"negatif","predict":"negatif"},{"text":"moonton tolong dong perbaiki masalah jaringan, saya sangat kecewa sekali karna jika tidak war jaringan bagus, jika war ping langsung 200an, kadang bagus, trus 200 lagi tolong dong perbaiki..................bener bener gajelas game ini, tolong dong moonton. Jadi males gw pngen gw hapus ni game. tambah lagi dapet tim nya yg bot terus capek moontonnnnnnnn","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa ya sering banget kalau lagi ranked sinyal jumping terus, padahal gaada masalah jaringnya sinyal bagus² aja tuh tapi ntah kenapa suka jumping apa lagi kalau lagi main rank sering banget jump, giliran relog loading nya lama banget smpe match nya keburu berakhir, ga di loading screen, ga pas loging sama² lag terus sinyalnya, kadang² juga ms merah eh pas di pencet ijo, parahnya kadang² bisa smpe 200ms, tapi giliran main classic lancar² aja tuh jaringan, jadi males main rank","sentiment":"negatif","predict":"negatif"},{"text":"Update terus bukanya jaringan tambah bagus dan lagi macam udah tambah beda ml sekarang embel begitu banyak perubahan banyak orang yang tidak mengerti kalo update terus jaringan nya di perbaiki dong ini ay tinggal di tengah\" kota kalibata ya kali jaringan di tengah kota redup terus setiap login dan satu lagi jangan terlalu banyak update karna tidak semua player ml ini punya ram yang besar sama seperti saya stengah mati dalam game karna jaringan yang sangat tidak bagus sangat kecewa dengan game in","sentiment":"negatif","predict":"negatif"},{"text":"tolong, ini habis update kenapa jaringan merah terus? pass info ke jaringan ke rekan satu team jadi hijau? kek gmna sistemnya? kalau tau seperti itu mending jangan ada fitur ini, saya dikira bohongan. jaringan udh ngelag diinfo malah bagus? -jaringan yang dipakai tri","sentiment":"netral","predict":"negatif"},{"text":"Banyak sistem yang berubah, dan fitur cs di pemulihan akun tidak dapat membantu sama sekali, akun saya sudah di hack oleh orang, namun saat melakukan pemulihan akun selalu gagal dalam verifikasi... Bagus bagus","sentiment":"netral","predict":"netral"},{"text":"sangat kecewa dengan game ini sekarang... ping gane sangat tidak stabil rata rata 80ms dan bisa saja naik lagi ke kuning dan merah... ternyata bukan hanya saya saja yang mengalaminya.... bahkan teman saya sampai 20 orang dapat masalah seperti itu... capek... alhasil kalah... tidak berguna... indosat juga stabil... tapi seperti gamenya aja yang masalah... saya sudah mengaktifkan speed mode di pengaturan interface... capek... saya lebih baik hapus game ini.","sentiment":"negatif","predict":"negatif"},{"text":"Game moba ini seru tapi yang paling menyebalkan menurut saya adalah ketika saya bermain rank, rank saya saat ini epic..dan setiap kali saya rank pasti selalu kalah, tapi giliran saya main classic 1 kali langsung menang..sangat aneh bagi saya sebagai player. Jadi mohon untuk pihak moonton, tolong beri kami lawan yang seimbang dan macth yang seadil-adilnya. Itu saja pesan saya dan tolong diperbaiki lagi untuk sinyalnya. Terimakasih.","sentiment":"negatif","predict":"negatif"},{"text":"Game nya sangat bagus. Saking bagusnya sampai tidak bisa naik rank karena selalu dapat tim bodoh. Saya sangat mendukung Update besar. Semoga kedepan size game ini mencapai 10GB lebih biar player yang hpnya kentang tidak bisa main, biar tidak mengganggu kami yang mau main serius.","sentiment":"negatif","predict":"negatif"},{"text":"Para develomer mungkin merasa hebat atas kerja mereka yang sering meng-Update ntah itu Update Versi, Revam Hero, Eblem, tampilan UI mereka merasa hebat dan merasa ML itu semakin bagus setelah setelah dirobah menurut kepintaran mereka sendiri. Namun Motoon tidak menyadari dengan adanya hal seperti itu MLBB sekarang sudah sangat buruk baik dari Matcmaking, System yang kacau, Koneksi, perlawanan 5v5 yang tidak seimbang. Apakah Montoon sudah Meninggal? atau karna sudah kaya jadi banyak masa bodoh?","sentiment":"netral","predict":"negatif"},{"text":"Tolong saat sinyal merah\/kurang bgus saat permainan berlangsung jngan keluarkan dari match sebab saya coba login kembali dan ternyata saya dikeluarkan dari match padahal posisi kami udah mau menang...tlong perbaiki ini..klo mau dikasi rating 5","sentiment":"netral","predict":"negatif"},{"text":"Untuk game bagus tapi untuk menghubungkan akun dengan moonton terdapat masalah di dalam game, yaitu ketika saya sudah menghubungkan dengan moonton itu, tetapi ada tulisan \"alamat email ini belum terdaftar\" padahal sudah saya daftarkan sebelumnya, ketika saya mengganti ke akun lain, disitulah saya tidak dapat kembali ke akun yg sebelumnya, jadi di mohon untuk kembalikan akun saya yg sudah saya rawat itu, jika pihak moonton ingin saya menunjukkan buktinya, DM ig saya @cuma_pengen_hijrah","sentiment":"negatif","predict":"negatif"},{"text":"Gamesnya bagus, seru dan asik, akan tetapi matchmaking nya kurang seimbang (berat sebelah), musuhnya sering pake cheat, dan belum lagi di tim banyak sekali akun yang troll. Mohon developer untuk perbaiki matchmakingnya agar seimbang dan beri sanksi yang berat bagi akun yang troll (mati dengan sengaja). Saya rasa dengan pengurangan kredit score aja tidak cukup untuk para pemain lain yang serius menaikan bintang di games ini. Terimakasih","sentiment":"netral","predict":"negatif"},{"text":"Males banget. Akhir² ini server ml banyak bug trus lag. Kadang pas main apknya ketutup sendiri trus kadang suka lag padahal jaringan bagus,hp juga ok tpi sering bat bug terjadi..","sentiment":"positif","predict":"negatif"},{"text":"Bintang saya kurangi...monton apa apaan sih.gara gara keluar dari pertandingan di karenakan gangguan jaringan mestinya gak hrus kehilangan kredit scor... Gua udah coba kembali kepertandingan tpi jaringan nya sedikit ada masalah. Malah di kurangin kredit scor. Kalau bisa ditambahin pitur untuk memberikan alasan kenapa keluar dari game. Jangan asal asal ngurangin kredit scor aja.. Kalau kayak gini jadi males sama ini game","sentiment":"negatif","predict":"negatif"},{"text":"Dear Moonton, ini game sudah bagus cuman kalo nentuin team yang bener. Masa musuh nya mantan glory team nya epik abadi.Udah first pick Nana,saber roam,gak peka,main asal maju,dan lain lain. TOLONG DIPERBAIKI!!!!!!!!","sentiment":"positif","predict":"negatif"},{"text":"Tolong untuk player yang memakai cheat di tindak tegas jangan nunggu 3 hari baru di proses. Terutama player yang memakai cheat sript lag, map hack dan lain sebagainya yang menyebabkan lag, hal ini tentu sangat merugikan. Tolong ciptakan lingkungan permainan yang bersih, jelas hal ini sangat merugikan buat kami para player yang bermain bersih. Mohon di tanggapi moonton.","sentiment":"netral","predict":"negatif"},{"text":"Data game yang besar, pencarian Tim match sanggat buruk mengurangi minat sebagai player, tolong perbaiki lebih lanjut.","sentiment":"negatif","predict":"negatif"},{"text":"ini game makin hari makin aneh,kesan pertama tidak ada masalah terjadi,setelah war tiba-tiba jaringan lag parah,setelah di update lag nya juga bertambah parah ,tolonglah diperbaiki masalah ny","sentiment":"negatif","predict":"netral"},{"text":"Tetap Saya Kasih Bintang 1 Gak Akan Pernah Berubah,Rating Game Mobba Ini Memang Layak Dapat Bintang 1 Dari Saya,Karena Gamenya Terlalu Sering Kasih Drak System Ke Player Solo Rank Nya.Bikin Jengkel Aja Gak Berubah Rubah Dari Dulu Tetap Aja Bikin Saya Jengkel Dan Kecewa Karena Selalu Sering Kena Drak System Nya. Entah sampai kapan si moonton ini bakalan begini ke para player solo seperti saya ini,yang dimana selalu sering kena drak system nya.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong berikan tim yang sesuai dengan match,MMR. Agar tidak mendapatkan teman tim yang menyusahkan diri sendiri saya sangat geram akan hal itu yang dimana bukannya membantu malah membuat saya geram jadi tolong untuk developer diperbaiki lagi. Dan ini tidak bisa dibilang pencapaian akan tetapi ini sebuah penurunan penyesuaian dari game karena saya merasa sudah cukup lama bermain game ini. Sekian dan terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Bikin kesell iih skrng apa apa kena peringatan pdhl ga toxic loh aneh bgt,suka lag tiba tiba padahal jaringan lancar lancar aja.. semenjak update banyak banget bug nya. Kadang juga suka keluar tiba tiba","sentiment":"netral","predict":"negatif"},{"text":"Oy gak usah update lagi,semakin banyaknya update semakin banyak bug seperti terjadi nya keluar sendiri pada pertandingan ,dan karena di kira afk padahal gak afk , dilaporkan menyebabkan kredit sekor kurang ,padahal geme nya sendiri","sentiment":"netral","predict":"negatif"},{"text":"Saya sangat suka game nya, untuk tampilan sangat bagus. Hanya saja saya sangat tidak puas pada lag dan frame rate di saat war, yang membuat arah shoot tidak akurat. Tolong di perbaiki, setabilkan jaringan nya saat war. Karna bintang di rank sangat mempengaruhi peringkat pemain di kancah dunia. Satu lagi, tolong untuk lawan nya seimbangkan dengan level hero yang saat itu di mainkan.","sentiment":"negatif","predict":"negatif"},{"text":"Dulu updat masih aman,sekarang ga aman kaya banyak pengguna cheat jaringan,aku main mitik kalau pas udah mau menang tiba² sinyal lag padahal udah make wifi bagus,ditambah data kuota nyala,wifi dan data nyala,masih lag,dan akhirnya kalah,moonton tidak memperdulikan itukah ?,masih banyak lagi kaya tombol geser susah,sinyal dadakan ilang,DLL","sentiment":"positif","predict":"negatif"},{"text":"Tolong lah admin semenjak ML di perbaiki jaringan malah semakin buruk sinyal sangat suka jumping, dan juga sistem kalian dalam mempertemukan tim sangat lah aneh, bukan soal sesuai rank namun terkadang ada saja player joki yg skill nya tidak sesuai pangkat yang ia peroleh,jika terus begini lebih baik kami pindah game ke sebelah","sentiment":"negatif","predict":"negatif"},{"text":"Jaringan sangat tidak memuaskan. Sistem monton tidak memberikan waktu khusus untuk memberbaiki dan tidak ada pemberitahuan terlebih dahulu. Jika terus begini. Maka sebaiknya tutup saja apknya","sentiment":"netral","predict":"negatif"},{"text":"Game bikin pusing ini hanya di perungtungkan bagi yang berduit klo kita gak berduit pasti akan susah buat naek , capee maen game ini berantakan selalu di kasih tim yang gaje sedangkan musuh selalu di kasih musuh yang lincah aneh aneh!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Makin sini makin susah push rank dari jam 4 sore nyampe jam 10 malem tetep ajah bintang nya tidak nambah . Malahh kalau udah naik turun dapet tim yg nge bacodd mulu . Tolong moontoon di perbaiki lagi sistem nyahh dengan berat hati saya jadi kasih bintang satu terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Tolong buat developer untuk memperbaiki kualitas tim,sering dapet tim yang ga seimbang, jaringan yg sering ngebug,dll untuk segera di perbaiki,agar semua player nyaman dengan kualitas game tersebut,terima kasih","sentiment":"negatif","predict":"negatif"},{"text":"Mohon Maaf ya moonton🙏. Ini saya ada keluhan tentang update emblemnya. Kronologinya gini, kan tdi ak habis main classic pada waktu itu perbedaan levelku sama enemynya sekitar 2 level. Setelah itu ak kena damage skil 1 nana dan skil 2 nya langsung mati. Tolong y moonton🙏. Saya malah menjadi tidak nyaman dengan update kali ini","sentiment":"positif","predict":"negatif"},{"text":"Jaringan lag terus menerus dari pagi, siang, sore, malam, performa bermain tidak stabil di karenakan jaringan yang lag terus menerus, padahal kuota saya masih banyak, begitu juga dengan tim yang tidak seimbang, saya yang ingin meng up MMR jadi susah, kenapa harus seperti ini Moonton? Saya sebagai player mobile lejend merasa jenuh sekali bermain game ini tolong di perbaiki lagi, jangan hanya memperdulikan event besar besaran saja.","sentiment":"negatif","predict":"negatif"},{"text":"10 kli matchmaking tidak seimbang, tiap main kalah terus, 2\/3 kli matchmaking tidak se imbang ok lah bisa maklumin, ini 10 kali berturut-turut, sangat membosankan sakali, tolong di perbaiki untuk matchmaking nya, kasian yang pada usaha malah jadi lost karna dapat kawan setim nya tidak serius, mohon untuk di perbaiki... Tasuketekudasai 🙏","sentiment":"positif","predict":"negatif"},{"text":"Ini game makin lama makin ga bisa dimainin lagi, karena fitur andalan nya yang bisa langsung keluar dari game. Katanya mau meringankan beban dari hp yang RAM nya kecil, eh malah makin membebani. Katanya bisa di bawah 5GB di memori nya, lah disini kok hampir 7GB. Moonton, please kalo ada player pake HP yang RAM nya kecil, ya minimal ga bikin dia keluar game. Lah ini sampe 1000x pun ga bakal maen.","sentiment":"negatif","predict":"negatif"},{"text":"Makin kesini makin kesana. frezeeee saat war jalan sendiri kadang, di arahin diem di tempat gak mau gerak , aneh,, padahal sinyal lancar , game wajib unistal. membuat hati geram, 😣😩😩😠😠😤","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah moonton kalau kasih tim yang bener dikit, gua sebagai player solo rank cape sekali gendong 4 orang yang ga bisa maen, sekalinya dapet tim yang bisa main tapi musuhnya yang lebih jago,disini gua cuman berkeluh kesah, capeee asli gendong 4 orang yang ga bisa maen dan sekalinya gua mabar sama temen gua 2 orang pasti 2 orang random pada ga bisa maen tolong lah di perbaiki lagi kalau ngasih tim, niatnya ngegame itu bikin happy aja tapi malah di bikin emosi karena dapet tim ga pernah bener","sentiment":"negatif","predict":"negatif"},{"text":"Sekarang sering kali terjadi crash pada saat proses memasuki pertandingan, harus relog dari awal dulu yang dimana itu memakan banyak waktu, sehingga pada saat bermain gold dan level kita sudah tertinggal jauh dari musuh kita yang membuat game menjadi tidak seimbang. Tolong segera diperbaiki masalah crush ini, karena benar-benar mengganggu dan merusak 'feel' bermain game.","sentiment":"negatif","predict":"negatif"},{"text":"Game ramah kali lah, ada player yang bawa bawa yatim, cara ngomongnya, cheat nya, and lain lain. Plus kalo mau setim nggak pernah seimbang. And yang buat kecewa adalah, pas pencet sinyal waktu warna merah, yang muncul malah ijo","sentiment":"negatif","predict":"negatif"},{"text":"Makin hari main rank makin gak parah.. Di sisi lain tim musuh pada jago\" giliran di tim sendiri semua asal pick kadang mm sampai 2 buat apa coba tolong lah moonton dark sistem itu hapus aja.. Setiap hari ngepus cuma ngestak di sana\" aja selama berjam jam.. Kalo lama kelamaan gini ya bakalan sepi ini game bukannya have fun malah jadi males mainin..","sentiment":"negatif","predict":"negatif"},{"text":"Dulu game ini adalah favorit saya,tp sejak sering update yg GK jls buat kita jadi malas main,slalu kenak sistem matcmaking yg gak seimbang,tim kita troll Mulu,tim musuh jago\" Slalu lostrekk Jdi nya malas main skrng Auto mau unninstall mending game tetangga yg baru muncul gak jauh beda dngn game ini,tapi GK seburuk ini... Maaf,ini kata\" mewakili para player mobile legend's🙏🙏🙏🙏","sentiment":"negatif","predict":"negatif"},{"text":"Selalu ada bug di tiap tiap Hero yang terkadang ngeselin dan jatoh nya ngecheat kalo di pake, jaringan selalu diatas 90ping dan ga stabil, tiap ada update bukannya optimalisasi buat jaringan dan kelancaran bermain malah nambah game makin berat dan makin susah dimainin apalagi ram 3 kebawah, kalo update kedepan game nya udh makin teroptimalisasi bintang nya saya tambahin","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa main clasic selalu menang dpt tim bagus tp lok rank selalu jelek selalu dpt tim yg gk bisa main dpt sampah mulu. Main game bukannya seneng malah kesel mulu, rank gk bisa naik yang ada turun mulu. Heran dah","sentiment":"negatif","predict":"negatif"},{"text":"Game gak jelas, Developer nya aja kaga bisa bahagian playernya apa? Dikasih tim kaga jelas musuhnya jago jago trus kalo dikasih kalah kaga ngotak kalahnya ampe 10 kali atau lebih sekalinya menang sekali doang dikasih seneng nya di awal doang abis itu disiksa gmn mau maju kalo gini? Bikin olayer seneng aja kaga bisa banyak yang hapus malahan, emng lu kira lucu apa gituin orang? Pada stress malah, lagian bisa bikin game kaga sih? Matchmakingnya dari dlu kaga pernah bener kaga adil banget","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa setiap saya selalu mainkan jaringan tidak ada(ngelag), tim nya juga tidak seimbang, performa nya juga tidak sebaik update yg dulu dan mohon performa tim di perbaiki","sentiment":"netral","predict":"negatif"},{"text":"game terjelek untuk saat ini, keseimbangan team buruk. kasian yg main solo dapat team yg bego bego. yg diupdate\/dipentingin skin. untuk yg lain gak diperhatiin. apa buat game ini cuman penghasilan yg dicari dari hasil update atau ngeluarin skin baru. performa nya juga ditingkatin, apalagi ada system dark system yg gajelas. Gak banget buat Mobile Legend yg sekarang. pokok nya buruk seburuk buruk nya","sentiment":"negatif","predict":"negatif"},{"text":"Setelah update ada error pada aplikasi, sehingga harus update ulang, & mengakibatkan saya yg sedang akan bermain mendapatkan force close tanpa sebab, mencoba masuk beberapa kali gagal, baru setelah update ulang, semua kembali, akan tetapi karena itu kredit score saya berkurang, tolong ditinjau kembali laporan banding dari saya.","sentiment":"netral","predict":"negatif"},{"text":"Perbarui jaringannya lah jangan mulu skin selalu di perbarui . Mau untung tapi gamau denger masukan !!!! Mau masuk setiap pukul 12 siang susah amat buat masuk ke lobby padahal jaringan wifi bagus !!!","sentiment":"netral","predict":"negatif"},{"text":"Jaringan kacaw leg terus,,team pada nyalahan dan pada akhir nya mereka repot gua,dan kehilngan poin besar,,sudah tidak adil makin males main nya juga,,kalo emang kesalahan dari pribadi gpp di repot team lah ini kesalahan aplikasi dan team nge repot malah di setujui sama aplikasi,,itu nama nya lempar batu sembunyi tangan","sentiment":"positif","predict":"negatif"},{"text":"Kalo update itu memperbaiki keseluruhan, bukan memperburuk keseluruhan. Update mulu sampe kapasitas menjadi besar bukan membaik malah memburuk. Banyak dark system, jumping signal, delay matchmaking dll. Parah update doang gede peforma jadi menurun.","sentiment":"negatif","predict":"negatif"},{"text":"Gamenya bagus, tapi jaringannya merah mulu tim juga gak seimbang tim saya ngetroll mulu jadi susah ngepush rank, min jangan update mulu orang yang memori kecil mau main mlbb jadi gak bisa main juga ada banyak bug, jadi tolong diberbaiki ya min tolong ya. :))) juga kenapa ya min pas saya mau main tiba tiba keluar padahal penyimpanannya masih 2 gb lagi tolong diperbaiki ya min tolong ya min dan kalau mau ganti akun pun jadi gak bisa akun utama yang lain jadi ilang kenapa sih min hs kecewa berat.","sentiment":"positif","predict":"negatif"},{"text":"Tolong dong diperbaiki hp ku jadi lag2 atau patah2 terus..sama kalo login 15 menit dan match kalo mau main rank dan mode lainya hpku langsung agak patah2 kalo keluar dari gem nya langsung normal dan ke aplikasi lainnya soalnya aku gara2 lag aku sering kalah padahal grafiknya udah paling rendah bayangan d matiin ram hp ku masih cukup tolong perbaiki ini karena sangat menggangu sekali..","sentiment":"negatif","predict":"negatif"},{"text":"Jelek banget ini. Semakin di update semakin parah sinyalnya sering membuat lag parah bukan karena sinyal. Selalu saya memberitahu jawaban alasannya sinyal. Parah banget.","sentiment":"netral","predict":"netral"},{"text":"Tolong, sekarang ml makin lama makin broken. Perbaiki sistem Match Making pada saat Rank, buat lebih seimbang, dan sekarang jaringan saat sedang match sering hilang, terutama saat bermain Magic Chess, padahal sinyal saya dalam kondisi yg prima tanpa gangguan. Tolong diperbaiki semua bug kalau Moonton tidak ingin kehilangan KONSUMENnya.","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak player feed nya .player sampah tolong di ban aja .merusak populasi mobile legend Tolong moonton kurangi player feed kalo bisa di banned dari game Woy moonton bagus sikit kalo ngasih main yg feeder mulu. Utamain kenyamanan dalam bermain. Moonton kenapa tidak adil kalo ngasih team. Selalu ngasih teaam feeder. Saar macth tolong di sesuai kan lah Saya sudah tidak nyaman main game ini. Kalo bisa menilai tanpa bintang sudah saya nilai game ini tanpa bintang. Game ga jelas. Info chet ml","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak lose strek dalam permainan sehingga kami sebagai player mals main lagi dan dikasih lawan yg gak seimbang waktu detik2 kenaikan rank makin hari sistem moonton semakin hancur mungkin kalau lose strek cuma 1 kali 2 kali oke tapi ini kadan ad yg lose strek sampai 10 atau lebih mohon di teliti lagi bosan kami main nya kalau disistem nya begini trs sudh begitu kadang kalau sudh di pertandingan sering kereset ulang, kalau bisa sy tdk mau memberi penilaian walaupun cuma bintang 1","sentiment":"negatif","predict":"negatif"},{"text":"Game ini sangat bagus untuk dimainkan bersama anak2 TK yg masih belajar baca dan hitung. Karena sistemnya yang sangat bagus dan adil, sehingga para player yg masih receh di satukan dalam tim dengan player yg match ribuan dan main sudah bagus. Sehingga player yg sudah bagus bisa kesulitan naik rank. Sungguh sistem yg sangat bagus agar player tergiur membeli item di dalam game supaya dimudahkan naik rank. Sungguh karya game yang luar biasa. Semoga kedepanya semakin berkurang peminatnya.","sentiment":"negatif","predict":"negatif"},{"text":"bintang 1 buat kau moonton , makin update makin hancur semua tadi pagi masih bisa di buka atau di mainkan , barusan mau di mainkan lagi malah gak bisa bisa terbuka ini game , parahh kau moonton update di besar besarin tetapi kagak mikirin penikmat ini game yg dengan hp kentangnya seperti saya ini , belum lagi pengguna hp kentang yg lain di luaran sana , coba berfikir kesitu moonton kalau tidak ini game lama kelamaan bakal turun drastis pemainnya, terima kasih","sentiment":"negatif","predict":"negatif"},{"text":"Grafik nya keren dan game nya enteng GK gampang ngelag tapi tolong lah kalo kasi lawan yg sepadan jangan satu jago satu enggak kan malah jadi GK seimbang kalo gitu kapan naik ke mytik orang musuh sama team aja GK seimbang sama tolong untuk pemain nya kali ada yg ngomong kasar Lang di urus aja makasih itu aja","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah ya moonton,jangan bercanda mulu..penyimpanan ku masih banyak,tqpi bisa patah patah....buat lah kami nyaman..jangan gini gininterus,dinaikin kualitas grafiknya,eh malah terlalu tinggi katanya...lama lama males juga main ML kalau ngga ada perbaikannya....kasar emang,tapi kan menjaga team yg lain...sama satu lagi, kalau ada nerf itung itu dong. Membuat ketidak nyamanan dalam pertandingannn😒","sentiment":"positif","predict":"negatif"},{"text":"Ini game udah bagus di grafik dan skin skin nya cuma masalah nya di jaringan ktika pas war knapa tiba² merah sinyal nya klo udah mati bagus sinyal nya,pas war lagi merah lagi sinyal nya,sama di sistem matchmacking nya di kasih tim yg match udah ribuan tpi main nya kyak baru main ML dan musuh nya pd jago² pdahal macth musuh nya bru ratusan tpi jago²,stelah di update gk ada yg brubah sma skli,game nya makin kesini makin rusak di jaringan sma matchmackingnya","sentiment":"negatif","predict":"negatif"},{"text":"Nemu tim beban di classic, rank, brawl. Kalau musuh pro, gila gendong 3-4 pemain buat menang iya kalau musuhnya juga sama jeleknya masalahnya musuh kek udah top lokal aja padahal belum main di mhytic, tolong ya sesuaikan tim macht soalnya gak seimbang banget, tim gua bobrok sedangkan tim musuh pro, kalau ada ya tim musuh 1-2 player aja yang bodoh, lah ditim gua bukan 1-2 tapi 3-4 orang","sentiment":"positif","predict":"negatif"},{"text":"Even sekarang ini apaan sih, tiap kali mau klaim hadiah malah lag ga bisa keluar, terpaksa restart lagi, terus berulang seperti itu, jadi g aku klaim aja, tak biarin daripada restart terus","sentiment":"netral","predict":"negatif"},{"text":"Nge-lag nya masyaallah banget, apalagi suka nge-bug, tiba-tiba re-log padahal jaringannya bagus banget. Itupun belum seberapa, lebih parah lagi kalo musuhnya pro player dan temen satu tim isinya ampas semua. Ya jomplang lah atuh tooonnn, mohon diperbaiki sistem matchmaking nya ya muntun, saya selaku pemain solo rank rada gondok kalo dapet musuh partyan dan tim ampas.","sentiment":"negatif","predict":"negatif"},{"text":"Pembagian tim secara tidak adil, kendala sinyal akhir akhir akhir ini yang sering terjadi jumping meski pun sinyal saat itu stabil dan saat war atau keadaan penting yang memerlukan sinyal stabil malah terjadi jumping, mohon di perbaiki y","sentiment":"netral","predict":"negatif"},{"text":"Saya memiliki keluhan terhadap game ini, ping saat bermain selalu naik turun(dari hijau menjadi merah) tidak hanya 1x\/2x tapi lebih dari 20x dlm 1 match, terlalu sering terjadi apa lagi saat sedang kondisi war, event terlalu berat dan jarang ada.. slot ban di draft pick hanya 6 minimal kalo bisa 8 atau 10 lah biar lebih gampang ban hero' meta, apa lagi dark sistem yg sekali kalah bakal kalah terus sampe kita bisa menang dgn usaha sendiri, tim tidak sesuai, egois, kasar, dan tidk ramah!!","sentiment":"negatif","predict":"negatif"},{"text":"Game yg sangat membuang-buang waktu kita,sekali dikasih menang kalahny beruntun.sehingga waktu kita dihabiskan dgn sia-sia.lebih baik saya uninstall dan waktu saya bisa dimanfaatkan dgn hal yg bermanfaat seper main pokemon","sentiment":"negatif","predict":"negatif"},{"text":"Semakin kesini pemakaian kapasitasnya semakin besar game nya juga semakin menarik tetapi sangat disayangkan saat ingame ping jamping2 disaat war selalu ping jamping merah kemudian hijau. Ini sangat mengganggu permainan. Saat ini saya rasa buruk sekali soal sinyalnya semakin kesini tidak ada perubahan hanya memperburuk ingame saja.","sentiment":"negatif","predict":"negatif"},{"text":"Game dengan sistem tercurang... Banyak kesengajaan dalam macth yang Membuan pemain susah naik.. dilihat dari profil tim yang diberikan terlihat pengalaman bermain sangat tidak sesuai.","sentiment":"negatif","predict":"negatif"},{"text":"Saat pemilihan tim sama musuh sangat² tidak imbang, selalu saya dapat musuh yg sangat susah dan justru malah dapat temen ampas,saya sangat tidak nyaman dengan hal ini","sentiment":"netral","predict":"negatif"},{"text":"Min tolong setiap saya main,tolong bngt beri tim yang setara dengan rank kami masing² entah mengapa akhir² ini saya selalu mendapat kan tim yg ranknya sudah diatas rank kita. Kami mohon untuk setarakan gameplay dengan rank masing².","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa abis update ini sinyal sampek 200, padahal sinya wifi enak. Ml makin lama makin gk bener. Mungkin kalo semua player unistal aplikasi ml. Buru di denger kritik dan saran kita.","sentiment":"netral","predict":"negatif"},{"text":"Ping tiba² jumping,, suka leg patah².. Hadeeh.. event trus yg di utamain.. Giliran performa game gitu² aja dari dulu.. Makin males main dah.. Dan saya main kebanyakan invalid karna player memilih hero dgn lane yg sama.. tolong di perhatikan lagi masalah invalid ini.. Kalo bisa di rombak lagi seperti emblem yg sekarang.. terima kasih","sentiment":"negatif","predict":"negatif"},{"text":"Sering melakukan perubahan sistem Sehingga sering terjadi permasalahan di dalam game, performa bermain pun secara otomatis menurun, dan mungkin jika mode jaringan di dalam game bisa lebih di optimalkan, dan lebih di support kan kembali, itu bisa memperbaikinya, sama kayak di setting sama moonton kalo mau naik bintang tuh, pasti dapet temen yg jelek.","sentiment":"negatif","predict":"negatif"},{"text":"Untuk kali ini saya memberikan bintang satu di karena di dalam game terjadi banyak bug salah satunya terjadi lag padahal jaringan bagus dan ping dalam game berwarna hijau tetapi di dalam mact ataupun pertandingan terjadi lag saya harap masalah itu bisa di perbaiki","sentiment":"negatif","predict":"negatif"},{"text":"Saya sangat sangat tidak puas dengan kinerja moonton dark systemnya, mentang2 level udah tinggi, main selalu solo, di kasih campuran tim yang match nya ancur, bangke emang moonton","sentiment":"positif","predict":"negatif"},{"text":"Saya kasih bintang 1 Krn terkadang mendapat teman satu tim yg buta map ,ada 2 jungler,mm 2 ,danterkadang tidak ada tank nya. Dan lebih menyesalkan lagi musuh nya tidak sepantar dg teman satu tim nya dan masih ada bug nya seperti lama masuk ke dalam pertandingan dan loading game nya . Dan data Mobile Legends nya sangat besar tidak semua hp bisa dan itupun berdampak bagi monton contoh nya yg meng instal ML berkurang gara gara data yg terlalu besar","sentiment":"negatif","predict":"negatif"},{"text":"Monton ini maksudnya gimana mau sinyal nya merah perasaan wifi nya masih nyambung terus kuota ku masih banyak tapi kok udah masuk arly tetep gak bisa main aku coba setele setel in hp ke konter konter buat main ML aja tetep juga gak bisa. Apa gara gara banyak cheter yang di tiktok itu .pokoknya itu plis tolong bantu ya tolong saja juga ingin main.","sentiment":"positif","predict":"negatif"},{"text":"\"PING problem\" masih sering menjadi hambatan. Masalahnya di game 1 lancar, tau-tau di game 2 lag parah, dan lag nya pas bgt lagi war, kayak ada cheat\/PING yg memang buruk. Terus, rules di rank legend yg bisa invalid saat picking hero itu sering disalahgunakan: lawan yg gagal dpt hero incarannya langsung kompak memutuskan invalid. Sangat disayangkan rules yg (mungkin) untuk antisipasi adanya kesalahan pick hero malah dijadikan alat untuk berbuat curang.","sentiment":"negatif","predict":"negatif"},{"text":"Game ini ngambil alih hp kita saat lagi main,, posisi unggul dari lawan tapi tiba2 lag, aku pake Telkomsel dan Indosat. Saat lagi main Telkomsel lemah banget jaringannya sedangkan Indosat ga kebaca sama sekali jaringannya. Yang anehnya selesai main dua² jaringan hpku sangat stabil😂 (bukan masalah hpnya, aku pake ram8 )","sentiment":"positif","predict":"negatif"},{"text":"Terlalu banyak autosystem yg disetting sedemikian rupa untuk mengganggu suasana bermain para player. Saya sudah dua kali berada di situasi, dimana ketika berada di tier legend 2 bintang 2, sistem sengaja mempertemukan saya dengan player yang tidak bisa bermain sama sekali sebanyak 2 kali, sehingga saya turun ke legend 2 bintang 0. Saya merasa dihina setelah dipertemukan dengan bot pada match berikutnya. Setelah saya kembali ke tier legend 2 bintang 2, kejadian yang sama terulang. Jujur kecewa.","sentiment":"netral","predict":"negatif"},{"text":"Match making gabalance, lawan terlalu sulit. Namun, timnya kebagian yg baru main semua-_- tolong diperbaiki lagi, agar bisa sesuai dan sesuai tiernya.","sentiment":"positif","predict":"negatif"},{"text":"Game ini makin parah. Masak setiap x main kalah selalu... Dan dapat tim sebegok aplikasinya. Memang sudah diseting Montoon. Kadang kadang jaringan bagus tapi bisa ngelag.. parah setingannya biar gak bisa naik level selanjutnya dikasi kalah terus....","sentiment":"negatif","predict":"negatif"},{"text":"matchnya sangat buruk, match mengabungkan pemain lama dengan pemain baru sehingga keseimbangan tim jadi hancur, dan itu tidak terjadi hanya sekali melainkan berkali-kali. Membuat gamr menjadi tidak fair.","sentiment":"positif","predict":"netral"},{"text":"Moonton tolong bagaimana ini kok saya sudah download data selesai kok masih jelek tampilan Hero danskinnya. Padahal kalo belum selesai download data kan ada gaya zilong no skin tapi ini kok gak ada gaya apa pun bagaimana ini!!","sentiment":"netral","predict":"netral"},{"text":"Mangkin updet makin banyak bug jaringan selalu leg padahal paket baru di isi,tolong la moonton,di perbaiki,sama satu lagi biasanya mau lihat tampilan skin bisa di unduh di skin hero tapi sekarang gabisa,tolong diperbaiki,terima kasih","sentiment":"netral","predict":"netral"},{"text":"Sudah tidak layak untuk hp kentang, mohon perhatiannya untuk monton agar dapat menyesuaikan apknya untuk yang hpnya dibawah standart, kasihan orang yang hpnya \"kekurangan\" lah istilahnya. Biar kita semua dapat menikmati game ini bersama. Oh ya 1 lagi, kalau ngasih tim sama lawan itu yang seimbang, masak musuh nya jago-jago dikasih tim yang masih pemula. Mohon perhatiannya.","sentiment":"negatif","predict":"negatif"},{"text":"Matching tidak seimbang,main solo,ketemu trio,yang satunya mitik honor ngajak Mabar legen 1 dan 2,sedangkan pihak musuh,rank mitik,engga ada legen,engga seimbang,makin membosankan.main dari 2019,dah mungkin saat nya pensi","sentiment":"netral","predict":"negatif"},{"text":"Monton kalo ngasih musuh yang imbang. Jadi saya menang kalah trusss. Perbaiki MOBILE LEGENDS BANG BANG game nya tolong di perbaiki. Kalo ngasih teman jangan beban tim semua Ingat!!: GAME NYA DI PERBAIKI!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"setiap bermain jarang bener pasti ada aja kendalanya. tim nya gak seimbang, pas main ping nya tinggi banget padahal sinyal bagus buat ig youtub juga lancar lancar aja. tolong buat developer untuk segera ditangani","sentiment":"positif","predict":"negatif"},{"text":"Saya sudah cukup lama memainkan game ini, awalnya seru namun setelah masuk ke rank yang lebih tinggi disini match making langsung kacau, ketemu tim yang egois, tidak sportif dan sering menemukan player trol di rank jika trol di game play clasic akan saya maklumi tapi ini rank bro tempat dimana orang bermain serius. Ini sih namanya bukan moba 5vs5 melainkan 1vs9. Saran saya ada gitu fitur yang bisa mendeteksi tim trol lalu langsung ban","sentiment":"negatif","predict":"negatif"},{"text":"Makin lama makin jelek segi bug . Chiter nya. Dan matching nya tim kawan kaya apa lah main nggak tau main mod darf pick tapi kalau tim musuh seperti sudah berkali kali naik turun mayticy . Maka dari itu saya uninstall game ini MAAF MONTON KALAU MAU GAME INI RAME LAGI TOLONG DI PERBAIKI SEPERTI SARAN DI ATAS TERIMAKASIH","sentiment":"negatif","predict":"negatif"},{"text":"Game yang makin kesini makin hancur permainan nya, dulu tidak sehancur gini, tim dan lawan setara, sekarang kita diberi tim bot sedangkan musuh tim party, di era season 1 memang grafis belum ada perkembangan tapi permainan sangat sportif seimbang, sekarang grafik hd tapi permainan tidak sportif, percuma jika kita sering melapor tapi tidak ada perubahan perkembangan.","sentiment":"negatif","predict":"negatif"},{"text":"Gabisa masuk mulu kesel giliran udah masuk terus keluar sendiri afk gabisa main rank. Barusan tadi sore saya main pake Franco terus udah menang udah mau ke lobby terus tiba tiba gabisa masuk katanya ilang jaringan terus pas sekarang login lagi game yang pake Franco gaada terus point ga nambah aneh nih cape cape ko gaada ya haduhh Jaringan mulu ni gimana padahal udH pake wifi udah pake data tetep aja jelek pas mau Warr","sentiment":"negatif","predict":"negatif"},{"text":"Season baru saat gameplay sering trouble, padahal jaringan 4G+, saat di relog sudah 100% tapi tidak bisa masuk ke dalam game, sudah terjadi sebanyak 2 kali","sentiment":"negatif","predict":"negatif"},{"text":"Matching nya tidak jelas tidak seimbang, makin update makin kesini bukannya malah lebih baik malah makin rusak. Matching nya tidak seimbang, jaringan suka naik turun bug lag pas masuk pertandingan, bug lag pas awal masuk pertandingan, gratisan makin berkurang, niat lanjut apa enggk nih game kok malah makin gajelas rating aja turun parah kacau nih game. Jika terus seperti ini bakalan kesaing sama game yang lain","sentiment":"negatif","predict":"negatif"},{"text":"Matchmaking makin gak seimbang. Lose streak panjang bet kayak deretan gerbong kereta. Game nya sering tiba-tiba nge-lag. Sinyal merah. Padahal koneksi baik-baik aja. Main game sebelah juga gak ada sinyal merah. Kapasitas game makin jumbo, jadi bingung ini PC game apa mobile game.","sentiment":"negatif","predict":"negatif"},{"text":"sering framing padahal sinyal bagus. Sering kalah gara2 masalah ini. Cache udah dibersihin aja tetep freeze. Jelek kamu ya sekarang. Ping selalu tinggi padahal sinyal stabil. Pengen gue maki kang IT nya","sentiment":"netral","predict":"negatif"},{"text":"setelah di upgrade analog kadang tiba tiba susah di gerakin. Ini menurut aku ya gatau kalo kalian rasain juga jarak serangan hero kayak ulti nya si amoon juga pendek kayak dlu masih bisa kabur pake ulti sekarang susah. Skill aku auto turun drastis. Di update nambah bagus dong, di update kok nambah kayak game murahan.","sentiment":"negatif","predict":"negatif"},{"text":"Pas main sinyal langsung jelek, padahal kalau ngebuka aplikasi lainnya lancar-lancar aja. Mana jaringannya langsung jelek pas mau nyerang lagi. Udah gitu buat matchmaking seringkali harus nunggu 2-5 kali. Saya keburu males buat main padahal tadinya antusias.","sentiment":"positif","predict":"positif"},{"text":"Game rusak, saya keluar sendiri dari aplikasi anda dan saya harus login ulang, ketika saya login ulang secara tiba tiba saya di ban dari mode ranked selama 22 jam, kamu kira ini lucu? Setidaknya anda harus mengerti sama player anda, tidak seenaknya nge ban 22 jam dari ranked, udah ngasih match ga jelas, sekarang di ban dari ranked hampir selama 24 jam, game rusak!!","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa setelah update tidak ada fitur jeda download data padahal sebelumnya ada,jangan memaksakan download data dong paket sekarang mahal,tolong kembalikan seperti yang sebelumnya, dear player kirim ke email anda untuk mengetahui","sentiment":"netral","predict":"netral"},{"text":"Dah makin tolol game ini, seperti unduhan malah unduh kehendak sendiri.. bukannya keputusan yang punya Acun dasar game terpelit yang pernah saya main,makin lama sampahnya semakin numpuk tak berguna seperti skin Hero yang di kasih sedangkan heronya tak kita punya seharusnya klaw kasih skin Hero yang kita punya dong walaupun skin gratis 1 hari,jadi tidak numpuk jadi sampah di jual nggak bisa game payah.","sentiment":"negatif","predict":"negatif"},{"text":"Ada faktor di game moba yang saya review antara lain :  1 . Tolong perbaiki sinyal terutama untuk kenyamanan saat bermain , kalo saya review di comment mobile legend kendala utama yaitu sinyal dan itu benar ..  2 . Untuk update itu sudah bagus dan tidak masalah tapi lagi-lagi permasalahan nya yaitu sinyal dan itu benar .. 3 . Kenapa update disetiap season itu tolong dikurangi dan perbaiki saja soal update yang mempengaruhi tiap player seperti sinyal yang naik turun kadang ( 20 ms \/288ms )","sentiment":"negatif","predict":"negatif"},{"text":"Game rusak makin update bukannya di fix bug jaringan nya malah makin parah bug nya padahal jaringan lancar bahkan make wifi tapi masi aja ngelag mau make wifi\/data bug jaringan yg mengurangi pengalaman bermain kalo kek gini mending g usah di download aja","sentiment":"negatif","predict":"negatif"},{"text":"Tolong tambahkan fitur untuk memilih file mana yang ingin diprioritaskan. Tolong utamakan mengunduh gamemode seperti Brawl, Magic Chess, Arcade, dan MPL. Tolong jadikan download skin menjadi opsional, jangan diharuskan untuk diunduh. Tambahkan opsi untuk menghapus resource skin yang tidak dimiliki. UI download manager yg baru jelek bener. Mau pause aja harus nunggu download beberapa ratus MB dlu, benar-benar ngabisin kuota dan storage.","sentiment":"positif","predict":"netral"},{"text":"Tolonggg dong, kenapa ping jumping mulu gak jelass. Padahal di lobby 5-10ms lancar jaya, tapi pas main ping suka loncat-loncat gk jelas. Diperbaki lah, udah dari kemarin kaya gitu.","sentiment":"positif","predict":"negatif"},{"text":"Aslii game parah stressss, main game buat hiburan malah tambah stress, apalagi match making nya sekarang parah, masa dapet random maych masih dibawah 100 ga seimbang sama musuh, tolong diperbaiki system match making di rank nya, harus seimbang match, minimal ga beda jauh lah jumlah pertandingan, berasa di kasih bot parah asli, giliran udah kalah 4 kali baru dikasih menang, itu juga lawannya bot ngeremehin parahhhh....","sentiment":"negatif","predict":"negatif"},{"text":"Lebih teliti lagi dong terhadap players curang yang menggunakan cheat agak kenyamanan bermain tetap terjaga. Kami yakin banyak players curang yang tidak terdeteksi moontoon","sentiment":"netral","predict":"negatif"},{"text":"setelah di update, memori yg di pakai sampe 7gb, katanya buat kenyamanan player, nyatanya cuma buat kenyamanan hp yg ramnya banyak, sedangkan hp kentang ngelag hingga panas, dlu tiap hari main mlbb, tapi setelah di update ram tidak mencukupi, jadi terpaksa saya uninstall, padahal sudah sangat nyaman bermain mlbb. saya mengaku kecewa. anjayy min, gw comback lagi, hampir semua aplikasi gw apus bjir, tapi gaoaoa, gw comback juga buat mabar sama crush wkwk, final chapter 😋😋😋😋","sentiment":"positif","predict":"negatif"},{"text":"Game nya nyebelin, setiap main lag terus . Sebelum main aja sinyal \/ ping bagus² aja ,pas main langsung ping nya jelek . Emang game HARAM!!!!!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"ajg bnr ni game , bug tolol baru masuk game ping merah gabisa gerak pdhl jaringan lancar , kadang di awal loading ga masuk masuk layar item doang , alesan hp gw ram kecil? hp gw ram 8 mana bisa gitu , baru masuk game dibacotin tim , karna apa? karna bug dari pihak nya yang gajelas , kadang ngasih tim ga bnr , kadang bug jaringan apa maunya","sentiment":"negatif","predict":"negatif"},{"text":"sumpah kecewa banget sama moonton, makin sini bukan makin oke, malah makin parah aja ini game, jaringan anjlok mulu, sinyal saya bagus tapi pas main selalu lag, hero yang saya pakai pun ga gerak nge lag parah merah terus, kami cuma pengen main yang nyaman aja moonton sinyal bangus ga lag dapet mact tim yang sesuai sama lawan.","sentiment":"negatif","predict":"negatif"},{"text":"Devloper Mobile Legends :Bang bang atau seluruh staff dan pengurus yang tidak berguna!!!!! kalian itu kerjanya apa??? ngetik bahasa indonesia aja diban , 5x ngetik kata \"curi buff musuh\" aja di mute + credit score -3 , kalian pikir para pemain indonesia bisa beradaptasi dengan game ini kah??? setiap 1 jam untuk ngetik \"curi buff musuh\" kena mute!!! kalau bikin game jangan menilai dari bahasa!","sentiment":"negatif","predict":"negatif"},{"text":"dikarenakan seringnya terjadi masalah untuk mengunduh ulang konten konten yang sangat penting dan karena itu tolong sekali saya meminta agar di update selanjutnya tidak terlalu menggunakan memory terlalu banyak Terima kasih.","sentiment":"netral","predict":"negatif"},{"text":"Sangat buruk ,,setelah update game sangat parah padahal HP ram 8 aja lag n frame gak ketolong,, update bukane makin baik malah makin buruk seperti kotoran,,, di tambah tim gak seimbang game payah,buruk dan sangat tidak bermutu","sentiment":"negatif","predict":"negatif"},{"text":"Min knp sih game ini kayak error bgt masa musuh gue jago giliran tim gue bot gmn sih perbaiki lagi nih game..... Kalo ngak gue nanti hapus game ini soalnya gue sebel bgt masa gue main rank kalah kalah mulu udh itu ngeleg padahal sinyal nya bagus dan aplikasi ini membuat penuh memori hp saya tolong di rendahkan lah minimal dan satu lagi itu musuh nya koh jago jago bgt jadi saya kalah kalah mulu..... Saya kasih bintang satu aja biar di kasih pelajaran. Sekian terimakasih 🙏","sentiment":"negatif","predict":"negatif"},{"text":"Jelek benar. 1, jaringan udah bagus di suruh menghubungkan ulang.. ya itu sampai honor skor ku 99 2, lawan tidak seimbang dengan pangkat Udah itu aja tolong di perbaiki lagiii ya kalau gak di perbaiki mau tidak mau ku unistal aja game itu. Tolong ya monoton di perbaikin","sentiment":"negatif","predict":"negatif"},{"text":"Makin di update makin parah, sering nge lag lagi, apa lagi pas download isi dalam nya lama banget sekarang, di tambah ganti akun dari kecil ke besar susah padahal sudah di kaitkan ke semua nya, parah sekali, sangat sangat sangat kecewa sekali sama moonton","sentiment":"netral","predict":"negatif"},{"text":"Game rusak, draf pick normal pas di pertandingan tiba² menghubungkan kembali alhasil saya dinyatakan afk, credit skor hilang tim kalah mmr wr turun, apa mungkin lawan saya orang2 yg banyak beli diamon di game ini sehingga saya di sulitkan agar tim lawan menang dengan mudah???!!!","sentiment":"negatif","predict":"negatif"},{"text":"Match-nya gak seimbang karena tim saya match-nya aja masih sedikit sedangkan musuh pada jago jago padahal gua dah berusaha semampu gua tapi dapat yang aneh aneh Mulu,ada yang egoislah.Semoga Moonton lebih bijak dalam membuat matchmaking.Terimakasih","sentiment":"netral","predict":"negatif"},{"text":"Game nya bagus sih, vitur nya juga bagus, tapi saya heran dengan tim nya kenapa tidak seimbang,saya sering mendapatkan tim yang gatau strategi dan saya juga sering mendapatkan musuh yang hebat, saya harap moonton mempertimbangkan nya, terimakasih :]","sentiment":"positif","predict":"negatif"},{"text":"Semakin lama gamenya semakin gajelas padahal udah di setting di data ke 5 malah pindah lagi ke data yg ke 4 jadi ngabisin kouta aja lol udah mahal beli kouta sekarang malah disuruh download data yg diulang lagu sama moonton,ini yg berhak ngatur data siapa sih yg jelas?moonton?apa kemauan kita sendiri yg menentukan mau download data yg mana?","sentiment":"positif","predict":"negatif"},{"text":"Ini game 5 vs 5 serasa main sendiri gua main trio sama tier tinggi di temuin sama publik ya gatau main gimana mau imbang sedangkan performa musuh jago jago kalo ngga ya dari sistem ketemu tim yang sengaja ngetroll yang bener aja update terus tapi player lain ngrasa ga nyaman sama tim yang mainya gajelas. Perbaiki dong","sentiment":"positif","predict":"negatif"},{"text":"Game nya udah bagus,tapi sesuaikan lah musuh nya ama tim nya,sering terjadi ketidak adilan,tim nob vs musuh hebat contoh nya","sentiment":"negatif","predict":"negatif"},{"text":"Keseimbangan dalam matchmaking nya sgt kurang. Tdk seimbang tim nya. Tim sndiri noob, tim musuh pasti tier tinggi dan kuat2 semua. Pls jgn mikirin hero dan skin2 dl, tlng di perbaiki masalah ini dan jg bug2 yg meresahkan. Terima kasih.","sentiment":"netral","predict":"negatif"},{"text":"Tolong lah ada opsi untuk tidak auto download data saya ingin main di kapasitas rendah, saya menggunakan data jadi kalau pakai data dan di paksa download data saya akan merasa rugi, dan tidak ada opsi untuk memberhentikan nya tolong tambahkan fitur itu 🙏 walaupun sudah fitur hanya wifi tapi tetap tidak bisa diberhentikan","sentiment":"positif","predict":"netral"},{"text":"Montoon aneh!!!!!!!!! Setiap aku ketemu musuh tiba² sinyalnya jelek dan gk bisa gerak sama sekali dan setelah sinyalnya kembali bagus pasti sudah mati di kill oleh musuh. (Padahal Wi-Fi nya sinyalnya bagus) DASAR ANEHHHHHHHHHH!!!!!!!!!!","sentiment":"netral","predict":"negatif"},{"text":"Sering laq kalau pertandingan sedang berlangsung. Waktu pemilihan masih normal dan kalau di deteksi jaringan bagus tp kalau sudah mulai bertanding sering lag","sentiment":"positif","predict":"negatif"},{"text":"Mohon untuk moonton, di update lagi sistem match nya saya selalu mendapatkan tim yang tidak berguna di setiap pertandingan, Padahal saya sudah berusaha semampu saya untuk memenangkan pertandingan tetapi tetap saja kalah Karena mempunyai tim yang tidak berguna, Padahal tim lawan sangat kompak di awal pertandingan sampai akhir pertandingan, mohon sistem match nya di update lagi untuk kedepannya.","sentiment":"netral","predict":"netral"},{"text":"Apa apaan ini akun ku masuk test beta, tapi resource nya udah 3 hari gak mau ke download, padahal penyimpanan masih banyak tapi tetep aja ga ke download hero nya masih bulat bulat..","sentiment":"netral","predict":"netral"},{"text":"Game nya Bagus tapi game ini juga membuat steress game nya gak setara dengan tim , dan musuh pasti kalo saya rank ketemu nya , musuh nya jago tapi tim saya pada noob bisa di bilang lol saya capek sebenarnya mau. Ml karena epic Mulu gak naik naik rank pengen saya kayak temen temen saya keluar dari epic gampang bgt , kalo saya kayak mau keluar epic itu berasa keluar dari penyiksaan , maaf monton kalo saya malah curhat, saya ucapkan terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Gameplaynya bagus, cuman untuk pembagian tim tidak seimbang sama sekali, walaupun kemampuan tim diseimbangkan dengan saya, tapi kenapa tim lawan saya jauh lebih kuat (kompak), dan tim saya yang terasa tidak ada kontribusi ke tim sendiri, malahan membantu tim lawan (sering mati dan afk). Solo rank terasa sangat sulit karena kemampuan tim kawan dan lawan terlalu jauh, ditambah dengan lawan yang provokatif, menambah emosi ketika bermain. Game ini jarang sekali terasa 5v5, lebih terasa 1v9 sih.","sentiment":"negatif","predict":"negatif"},{"text":"Matchmaking tidak seimbang, solo rank 10x selalu dapet tim yang gajelas turunin bintang, menang 1x aja, kebanyakan update dan terlalu banyak cheater di tim lawan, game nya suka tiba tiba keluar sendiri. Tolong di perbaiki macthmaking nya, saya sudah 3 tahun main MLBB baru kali ini lose streak sampai 1 bulan selalu dapat tim tidak seimbang.","sentiment":"negatif","predict":"negatif"},{"text":"Ini setelah di update kok malah sering ngr jump sinyal tiba2 ngelag padahal sinyal sangat baik. Lagi dalam rank sangat merugikan player kalo seperti ini. Tolong di perhatikan bukan update malah makin hancurin match aja","sentiment":"negatif","predict":"negatif"},{"text":"waktu aku main mode brawl,pas udah pencet masuk,trus pas hitung mundur nya udah habis,layar hp ku stuck trus disitu,bug nya diperbaiki lah,jadi gak bisa main brawl kalo gini trus","sentiment":"positif","predict":"negatif"},{"text":"Monton gabecus , milihin lawan yg se imbang donk masa lawan nya hebat² semua , kalo gini gaada untungnya ,game itu untuk penenang dan hiburan ,bukan mala meperburuk fikiran ,katanya. Game strategi kok gini ,katanya game seru ,seru dari mana dapet nya temenya ga becus² .","sentiment":"negatif","predict":"negatif"},{"text":"Tolong developer moonton banyak sekali bug bug dan glict yang terjadi salah satunya lag tanpa sebab ini sangat mengganggu player untuk bermain dengan bebas dan saya selaku salah satu player MOBILE LEGEND ingin bertanya knp saya sudah mendowload semua resouch tetap tidak berubah dan skin saya tetap tidak mengeluarkan efek dan bug bug lainya trimakasih sebelumnya mohon di perbaiki ya🙏🙏🙏","sentiment":"netral","predict":"negatif"},{"text":"Info nih min, semenjak banyak update, banyak bug, terus user jungler juga retrinya jadi ga on point, tapi malah ke arah musuh, walaupun udah di tap tap berkali-kali ke arah jungle.. rubah min, Jan jadi game rusak begini","sentiment":"negatif","predict":"negatif"},{"text":"Aplikasi Ngawur, lg main kq aplikasi nutup sendiri. Pas di buka udah kalah. Utk main solo,, bs 10kali berturut lebih dpt tim yg tidak jelas.","sentiment":"positif","predict":"negatif"},{"text":"Performa semakin buruk, komunitas tambah toxic, chat disalahgunakan untuk hal negatif dan mengganggu kenyamanan dalam bermain, game yang seharusnya menyenangkan jadi berubah seolah hanya untuk kompetisi saja, clasic seharusnya main santai tapi sekarang seolah harus main seperti pro player yang serius, tolonglah moontoon kalau tidak bisa handle komunitas beri keringanan buat player agar event bisa diselesaikan dengan vs AI, setidaknya bagi player yang cuma cari kesenangan bisa ikut event juga","sentiment":"negatif","predict":"negatif"},{"text":"Sebanyak-banyaknya lu pada ngomong pada game ini tetap gak direspon sumpah dah kesimpulan dari game ini cuma satu yaitu:GAME PAY TWO WIN beneran dah dan itu kalo uang harus gede kaya satu juta dua juta hah segitu lu pada bisa menang cuma 3 hari doang jadi game ini gak wort it buat di main jadi yang mau download gak usah beneran gak usah mending uang lu pada buat amal itu bagus daripada ngasih game ini duit.","sentiment":"negatif","predict":"negatif"},{"text":"ga jadi ngasih bintang 5, soalnya saat saya bermain game ini terus menerus, saya mendapatkan jaringan yang tidak stabil, padahal posisi saya sudah menggunakan wifi + data, tapi hasilnya sama aja, saat lagi perang ping bisa sampe 500+, saat mati ke 7ms. tolong untuk ceo moonton lebih di perbaiki lagi","sentiment":"negatif","predict":"negatif"},{"text":"Entah kenapa sinyal nya sering eror, padahal ditempat saya sinyal nya kuat. Download resource aja lama, lebih dari 10jam... Game laknat. Yg paling parah kalau kita udah lama gak main. Tiba tiba-tiba turun peringat. Aku udah legend 1 tiba tiba lari ke efic. Game Sampah. Tiba tiba-tiba sinyal nya lemah, game asu game babi..","sentiment":"negatif","predict":"negatif"},{"text":"Yang kecewa riporr aja dulu kita riport klik titik tiga di atas, trus klik gambar bendera trus pilih rating konten tidak sesuai + spam gitu trus berkali kali biar puas.","sentiment":"netral","predict":"negatif"},{"text":"bagi tim gapernah adil,tim saya gabisa main sekali alias bot dan ga kompak sama sekali,sedangkan tim lawan kompak dan jago,kadang saya capek sendiri nge carry 4 beban di dalam tim ku sendiri,kalo masih kurang komposisi nya saya uninstall","sentiment":"positif","predict":"negatif"},{"text":"Update skin terus smpek lupa cara mengoptimalkan pembagian tim pada mode rank, tim sendiri rata² player baru+rank masih rendah, sedangkan musuh terlalu kuat\/ rank jauh lebih tinggi. Menyebabkan tidak seimbang dari segi gameplay, attitude, pola permainan, dll. Kalo tidak bisa dioptimalkan lama² saya akan mengunistal game mobile legend ini.","sentiment":"negatif","predict":"negatif"},{"text":"Download resource di MLBB tidak dapat di atur, sistem terlalu memaksakan untuk mengunduh data, sedangkan perangkat-perangkat kentang sudah tidak memiliki cukup ruang untuk data game, mohon agar sistem resource MLBB dapat di atur, sehingga membuat pemain dengan perangkat kentang lebih nyaman saat bermain","sentiment":"negatif","predict":"negatif"},{"text":"Semenjak update malah semakin lag jaringan sering jumping dri 80-89ms naik 188-258ms terus seperti itu, padahal jaringan lancar\" aja buka apl lain tapi pas main ml jaringan malah jumping mlu udh restart udh pake mode pesawat ttp aja jumping ping nya. Sangat menggangu apalagi saat sedang war, dan saat bermain rank pasti selalu bertemu dengan teman setim yg ga seimbang sama musuh, musuh jago teman setim malah bego ga bisa main alhasil saya stuck di honor. Mohon jaringan sama match nya di perbaiki","sentiment":"negatif","predict":"negatif"},{"text":"saya beri bintang satu karna kira ml\/ mooton bisa mendeteksi jaringan yg tiba² hilang d karnakan jaringan tiba² hilang bukan kerna meninggalkan permainan secara sengaja,ya bnr afk akan merugikan secara tim,tp kok menghilangkan kredit skor sampai 10 poin itu anda keterlaluan kesalahan yg gak kita buat secara sengaja melainkan ilang jaringan secara tiba²,sedangkan untuk memulihkan kredit scor yg hilang d batasi.silakan d Benet aja aku sya yg gk seberapa itu sya kira gk rugi juga anda. (Abi manyu)","sentiment":"netral","predict":"negatif"},{"text":"Mooton kenapa masih banyak bug gitu, jaringan nya merah mulu dari awal smpai akhir padahal wifi nya enak banget, dan sering keluar sendiri saat mau milih hero, dan banyak player yg menggunakan chet map heak tolong diperbaiki segera","sentiment":"netral","predict":"negatif"},{"text":"Saya memiliki keluhan terhadap game ini, saya selalu mendapatkan tim yang tidak dapat di andalkan dalam permainan, saya mengalami kekalahan sebanyak 7 kali lebih berturut-turut, saya sudah melaporkan nya ke form penyeimbangan matchmaking namun tidak kunjung mendapatkan perubahan, diberi kemenangan pun hanya 1 kali dan pada pertandingan berikut nya kekalahan terjadi lagi. Maka dari itu tolong untuk memperbaiki \"algoritma\" yang telah di janjikan berkali kali itu.","sentiment":"negatif","predict":"negatif"},{"text":"Game aneh, ini game kadang sengaja buat yang solo player yang online berjam2 akan diberikan tim yang tidak sesuai. Sehinggal win rate kita berkurang dan alesan moonton kalo winrate berkurang dikasih tim yg sama. Padahal dari awal aja ngasih tim random aja aneh! Nanti 4x lose streak kita dikasih lawan bot. Kalian ini cmn mau manfaatin orang2 yg sukan online ber jam2 ????","sentiment":"negatif","predict":"negatif"},{"text":"sekarang jaringan seringkali hilang ping menjadi merah terus , kenapa sich sama lo moonton jadi kaya gini , jangan update lo besar besarin tapi gak mikirin koneksi , makin lama makin banyak update makin hancur ini gameplay nya WARNING !!!!! BUAT DEVELOVER FIKIRIN ITU TANGGAPAN SAYA DAN BERGERAK JANGAN CUMA DI BACA SAJA (DI ACUHKAN SAJA) , INI BERAT BUAT KALIAN DEVELOVER JANGAN CUMA MENCARI KEUNTUNGAN SAJA DI GAME INI , BAGAIMANA CARA NYA AGAR DI GAMEPLAY LANCAR SAAT BERMAIN , THANKS.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong ya monton kenapa setiap saya main belum ada 3 menit saya sudah di restart kembali dan dari dulu saya begitu terus dan sering terjadinya afk tolong ya sekali lagi untuk di perbaiki karna di saya selalu restart tolong di perbaiki","sentiment":"positif","predict":"negatif"},{"text":"Makin gajelas ini game semenjak update jaringan makin parah ngelag trus pingnya makin ngaco, dan banyak sekali bug dibagian skil dan analog trus ada bug di hero valentina, beatrix dan joy, ini harus diperhatikan lagi jangan event\/skin trus yang di utamakan, kenyamanan player itu penting jadi harus di utamakan itu kenyamanan player","sentiment":"positif","predict":"negatif"},{"text":"Asli ini game gak usah dimainin lagi.. Mau solo mau mabar sama saja.. Kita memang dipaksa nya kalah.. Selain dikasih tim gak jelas cara terakhir nya sinyal dibikin nya gak stabil pas penting penting nya asli ini game gak jelas..","sentiment":"negatif","predict":"negatif"},{"text":"Mobile Legends: Bang Bang Mobile Legends: Bang Bang Salam sejahtera. Moonton saya sebelum nya ingin mengutarakan keberatan di dalam matching , kenapa selalu ada teman satu tim yang melakukan feeder atau bermain dengan aneh tidak sesuai role nya , lalu setelah permainan pasti mereka yang bermain aneh itu selalu OFF atau tidak aktif , dan juga biasanya jumlah pertandingan nya hanya ratusan , dan tier nya mentok di legend sedangkan tim lawan hebat hebat dan jago jago dan tier terakh Vuck you game","sentiment":"negatif","predict":"negatif"},{"text":"Sumpah parah kali sekarang, kenapa setiap main kalo lawan bawa lord ke base utama. Tiba tiba lag. Sering terjadi kalo main. Gk jelas sekarang. Main dari awal masih lancar tiba di akhir lag parah","sentiment":"negatif","predict":"negatif"},{"text":"Agak kece sih...dulu aku main ml enak-enak aja...tpi tadi download lagi terus coba login malah kembali² terus... padahal jaringan bagus, penyimpanan juga masih banyak... Tolong perbaiki biar gak kembali² terus!!","sentiment":"positif","predict":"negatif"},{"text":"Game serame ini ratingnya 3,6 dan ga pernah ada perbaikan yg signifikan. Ada sistem dark system, sistem report yg aburadul, sistem blokir pemain gajelas, emg bener bener trash game. Mending main ARENA OF VALOR dari pada game ini, cuma menang rame karna banyak bocil yg main. Bikin frenchise league seharga 30M, tapi ngedevelop game yg udh bertahun2 gini masih sulit. Mines dimana mana.","sentiment":"negatif","predict":"negatif"},{"text":"2023 makin berat main diponsel, jika ram ponsel RAM 8Gb keatas tidak masalah. dari penilaian bintang 5 tahun 2020, 2023 cukup bintang 1 nilai ini game, pengembangnya cuma kreatif tampilan game. untuk mode rank tolong klasifikasi winrate player. biar pertandingan adil.","sentiment":"negatif","predict":"negatif"},{"text":"Permainan tidak seimbang ,berat sebelah ,kalo ngasih random yang seimbang,untuk player dg skil rendah sebaiknya di temukan dg pemain yg skil rendah jg,karena sangat merugikan ,kasian yang mau main serius","sentiment":"negatif","predict":"negatif"},{"text":"Dark sistem detected.... Bug detected Sinyal di bar bagus internet lancar namun di in game = sinyal hilang \/ tidak stabil, malah di deteksi AFK. Wow , Seakan sengaja membuat seolah bug namun sepertinya memang di program seperti ini....","sentiment":"negatif","predict":"negatif"},{"text":"Game nya keren. Tapi plisslahhh dapetin tim impas sama musuhnya masa musuhnya jago sedangkan timnya baru main ml jadi gak jago. Plis ilangin dark sistemnya dongg..... kalo dark sistemnya dahh ilang aku kasih bintang 4\/5.","sentiment":"negatif","predict":"negatif"},{"text":"Ingin logout dari game saja tidak bisa. tidak ada fiturnya, ada fitur logout pun untuk perangkat lain bukan untuk perangkat yang digunakan sekarang, sangat jelek dari segi perancangan. Desain karakter terlalu banyak \"terinspirasi\" dari karakter game lain. Matchmaking tidak seimbang, juga tidak ada fitur Role matchmaking.","sentiment":"negatif","predict":"negatif"},{"text":"Knp habis update kalo matching nya infalid\/tim musuh pick Hero yg Lane nya lebih dari tiga, terus kita mau ranked lagi itu jaringan nya\/koneksi gagal ya.. tolong dong di perbaiki lagi soalnya mengganggu banget kita harus realog..","sentiment":"netral","predict":"negatif"},{"text":"Game macam apa ini setiap main di trol tim mulu dark sistem monton masi ada mohon bantuanya. Masa klo main dapat temen bot pless tolol trs musuh nya jago banget tolong perbaiki itu Update terus masalah gituan ga pernah kelar dari dulu. mohon tanggapan nya MONTON.","sentiment":"negatif","predict":"negatif"},{"text":"MONTONN.. tolonglah perbaiki sperti dulu lagi, semakin kesini semakin hancur sistemnya bikin hp rusak. kadang patah patah, kadang pula suka keluar sendiri. tidak seperti ML yang aku kenal dulu meski ram 1 LANCAR bikin tethibur.. jangan mentang mentang sudah mendunia. ingat kamu akan hanycut jika terus seperti ini.. TERIMAKASIH MONNTONG","sentiment":"netral","predict":"negatif"},{"text":"Game aneh!!! rating nya aja 3,6 pantass rating segitu Bagi saya! Maksud nya apa?! mau naik rank dapet tim nggak bisa main. Jaringan bagus di game ngeleg. Jangan download game ini, Mending game free fire aja!!! Main menag kalah mulu\" mau nya apasih ni game. Rating 3,6' sangat lah pantassss...!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Monton kapan perbaiki sih, masalah nya bisa nggak kalo kita tekeluar dari game, bisa masuk dalam game nya lagi dengan cepat?, ini nunggu ny lama banget, sampe kadang² game nya sudah selesai, sangking lama nya masuk dalam game nya kembali, ujung ujung nya malah di kasih \"afk\" padahal sudah berusaha masuk kembali dalam game nya, tolong kalo semisal nya masuk dalam game di percepaaaat!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Saya kasih bintang satu karena baru aja masuk game udah keluar sendiri padahal udah di bersihin hapus permainan lain buat download game ini tapi selalu lag mulu pas lagi asik malah sinyal nya ilang padahal pake wifi loh tapi tetep ga bisa apalagi kalo lagi main rank tim ku rasaya gak seimbang sama lawan gitu pliss lah benerin sinyal+tim nya kalo tim nya gak di perbaiki gpp asal sinyal aja di perbaiki itu aja sih yang aku mau bilang sekian terima kasih...","sentiment":"negatif","predict":"negatif"},{"text":"Matching nya tidak seimbang... Lose streak trs saat on proctetion point\/card nya trs menang jink, males gw dikasih matching nya ga imbang sama bnyk yg troll lalu sinyal ping nya bagus tapi malah ngelag saat pencet ping nya malah bagus selalu aja begitu PLEASE lah ya jangan kasih org dark sistem nya mulu capek oi jadi epik trs timnya bodoh dan ga imbang lah bs menang bisa kalah ga jelas woi kasih skinnya mahal mahal tapi game nya kayak t0l---l0\/ juga dah on protec pun ttp turun jink. Gw benci lu","sentiment":"negatif","predict":"negatif"},{"text":"Habis update malah tambah parah pas war jaringan jadi merah.. trus suka tiba\" PING 230 giliran mati PING 23 34.. jaringan naik turun ga stabil trus jadi afk yg di salahin player y.. bisa kena kredit skor, bahkan kna banned.. padahal bukan dari playernya tpi in game nya..","sentiment":"negatif","predict":"negatif"},{"text":"Saya kecewa dengan pelayanan game ini. Ketika saya menggadu karena lag tidak bergerak sama sekali dalam beberapa menit. Di bilangnya sinyal dari saya yang kurang bagus. Justru saya sudah mengecek ke kuatan sinyal saya sebelum bermain, dan memang sistem dari game ini aja yang buruk tiba-tiba freez begitu saja. Aneh Lo moonton","sentiment":"negatif","predict":"negatif"},{"text":"Makin lama makin kurang profesional. Selalu di temukan dengan musuh yang sulit dan tim yang kurang baik. Mengalami lose streak 5 hari berturut. Mau ngilangin stres malah jadi emosi gara gara game.","sentiment":"negatif","predict":"negatif"},{"text":"Saya sangat kecewa dengan performa masalah pertandingan. Saya player solo ketemu dengan player full mabar. Dan lebih parahnya lagi masalah perbedaan rank, epic, legend dan mythic dicampur. Tolong kembalikan performa pertandingan seperti yg dulu","sentiment":"negatif","predict":"negatif"},{"text":"Apa apaan, gak ada angin gak ada hujan tiba\" suara ingame,skill ingame, skin Hero,suara Hero, emote, musik background tiba\" ilang.. seakan belum download resource padahal ke download semua.. update gede malah nambahin masalah","sentiment":"netral","predict":"negatif"},{"text":"Kenapa setiap main rank akan naik tier selalu dipersulit? Contoh: lawan tidak seimbang, main dengan tim newbie, sinyal ngelag, bahkan sampai item terasa no damage padahal level maksimal! saya bermain cukup lama namun saya juga top up setiap ada event, jika memang sistem dibuat seperti itu saya pastikan akan hapus game ini dan berhenti bermain, saya main demi kesenangan dan permainan yang imbang, namun semenjak 1 tahun terakhir game ini membuat frustasi","sentiment":"negatif","predict":"negatif"},{"text":"Moontod pilih kasih yg Sultan di kasih win strik yg player gratis di lostrek kan tolol + aku sering ngestak di loading secreen dan harus restart game sebanyak 5 kali baru bisa masuk itu pun dalam mode brawl ajh di mode rank dan classic gk bisa","sentiment":"negatif","predict":"negatif"},{"text":"Kok ml sekarang banyak bug nya ya kek ga bisa masuk mode yang satu land itu loh pas udah pencet masuk yang lainya juga kok ga bisa masuk ke pertandinganya sih sama lag parah padahal sinyal lancar lancar aj sama sering stuck loading","sentiment":"netral","predict":"negatif"},{"text":"Game gak jelas,matchmaking nya gak ngotak,tim ga jelas,banyak bug,dan bikin pusing,dark sistem parah,yang bikin kami sebagai player ml merasa kecewa,dan ditambah lagi,jika ingin naik mitich,pasti dapat tim poke,dasar moonton","sentiment":"negatif","predict":"negatif"},{"text":"game nya bagus,update juga terus menarik tapi dari dulu sampai sekarang masih eneg sama masalah jaringan di game ini, padahal sinyal sedang lancar tapi sinyal tiba-tiba hilang dan beberapa kali saat inmatch atau draft pick sering tiba-tiba kembali ke lobby dengan masalah jaringan terputus, mohon segera diperbaiki untuk kenyamanan player kedepannya 🙏","sentiment":"negatif","predict":"negatif"},{"text":"Setelah di perhatikan, bermain game ini buang\" waktu karena \"dark sistem\" yg memungkinan mendapatkan team bot serta opsional jaringan tidak stabil. Tingkat rate untuk menikmati game ini semakin hilang bahkan hampir tidak ada. -berhenti bermain ini dapat meningkatkan mood dan beban pikiran -berhenti bermain ini dapat menggunakan waktu optimal dr waktu yang terbuang karna \"dark sistem\" -berhenti bermain ini dapat mencegah sakit hait dari hinaan player toxic tingkat akut.. KOK YA ADA YG NGASIH \"B5\"","sentiment":"negatif","predict":"negatif"},{"text":"makin lama makin dapat tim yang gak seimbang entah troll \\ feeder , stuck legend terus gimana mau main menang 1x kalah 2 - 3x, brengsek lah. parah + match 2000.n di kasih tim match 300.n bahkan ada yang baru 100.n astaga.. mentingin duit mulu kek nya daripada kenyamanan player.","sentiment":"positif","predict":"negatif"},{"text":"Apĺikasinya tolong diperkecil ukurannya Terlalu berat untuk hp ram 1 sampai 2 gb-an Game sebelah aja gak sampe belasan gb Sedangkan game yang sering terinspirasi dari game lain ini udh nyampe 12 gb Please!!?!?!?!!!! Tadi saya main pakai gusion tiba tiba frame drop setelah beberapa waktu tiba² MLBBnya login ulang Tolong perkecil ukurannya Lakukan juga lah system akun smurf diban karena rank tier rendah cukuplah dg orang orang yang baru belajar main please!?!?!!!!","sentiment":"negatif","predict":"negatif"},{"text":"pencarian tim yang tidak adil membuat saya sebagai player merasa tidak diuntungkan dengan sistem yang anda buat, yang seharusnya saya ingin naik ke glory malah seperti sengaja digagalkan dengan tim yg feeder atau team yang tidak bermain dengan bagus jika boleh berkenan tolong perbaiki sistem tersebut karena sistem tersebut membuat saya ingin membanting hp jika anda masih ingin melihat player anda senang bolehlah kalau diperbaiki sistem tersebut, plis moonton pliss pliss pliss pliss pliss pliss p","sentiment":"netral","predict":"negatif"},{"text":"Moonton tolong untuk memperbaiki masalah koneksi,masalahnya ping gak stabil,saya sudah 1 bulan mengalami hal tersebut,padahal saya sudah memakai wifi,atau pun data seluler tetap saja sama.tapi klau membuka aplikasi lain seperti instagram,youtube,dll sinyal saya gak ada masalah.","sentiment":"netral","predict":"negatif"},{"text":"game sampah gak usah di install nyesel kalau di install game Dajjal hapus aja nih di play store setiap kali main gak pernah dpat yang bener gue solo nyet lu tolong nyerti lah kasih tim tu yang imbang dikit lah lu ada masalah apa sih Ama akun gue setiap kali gue main drop terus tim nya tolong lah di pertimbangnyin niat nya mau lepasin stres malah makin stres jadinya tolong lah ya plissss😭😭😭😭😭","sentiment":"negatif","predict":"negatif"},{"text":"Semakin kesini kok makin jelek..socketnya jangan dibalikin kepemaen yg lain klo yg lag..ikutan lag jadinya...sumpah jaringan full sinyal lag...pakai telkomsel paling mahal plus wifi ttp aja lag...bikin emosi.. Makin parah lag gak jelas padahal sinyal kecepatan tinggi...aaannnjjeeennnkkkk","sentiment":"positif","predict":"negatif"},{"text":"Kenapa setelah update, data mobile legends terhapus dan tidak bisa di download lagi data nya. Itu sangat menggangu karena saat bermain, bentuk Hero dan skill atau ultimate Hero tidak terlihat","sentiment":"netral","predict":"netral"},{"text":"Janc*k, ini game kok jadi berat banget sih, GK kayak dulu... Ml GK usah update Mulu ngapa... Ini hp ROG masih ngejumping Mulu sinyalnya... Tolong moonton hapus semua fitur GK jelas di Mobile legends, balikin lagi kayak dulu. Aku main gensin impact aja lancar banget di hp ini, tapi pas main Mobile legends kok jadi ngejumping sinyalnya, Emang Mobile legends ini cuma buat hp sultan aja apa!! Yang lain kasih kesempatan dong Bangs*t","sentiment":"positif","predict":"negatif"},{"text":"Setelah di update game nya semakin berat, sering lag meskipun jaringan bagus & sering mendapatkn tim yang bot...tidak sebanding dengan tim lawan...lama lama bikin kesel juga nih game, makin gak karuan pembagian tim nya, padahal dulu game ini sangat seru rapi sekarang jadi ngeselin, gara gara musuh nya gak sebanding dengan tim kita yang bot","sentiment":"negatif","predict":"negatif"},{"text":"Game ini tidak di sarankan untuk dimainkan, karena keseimbangan matchmaking yg tidak adil dan permainan tidak sportif rekomendasi game yg bagus , clash of Clans , rise of kingdom , genshin impact, modern warship. Kalo mau game yg bagus. Kalo kalian pertama kali download kalian pasti selalu menang, dapat skin gratis , dll. tapi kalo kalian udh 2-3 bulan main kalian pasti selalu kalah GK pernah menang, sering juga ngebug dan banyak masalah lainnya . Ml S3 marketing narik pelanggan kek gitu","sentiment":"negatif","predict":"negatif"},{"text":"Banyak player yang berkelakuan buruk seperti sengaja kalah, toxic, afk. Sehingga sangat susah untuk mendapatkan satu poin kemenangan. Meskipun mainnya sudah bagus tapi kalau tim sendiri gitu tetap aja susah menangnya. Saran saya tolong di perbaiki sistem perolehan atau pengurangan star-nya, walaupun kalah tapi kalau gameplay udah bagus seharusnya lebih minim dampak kekalahannya.","sentiment":"netral","predict":"negatif"},{"text":"Game suka ngebug. Pas udh masuk ke gamplay tiba² sinyal menghilang dan auto rilog. Tiba² stuck di loby dan kg mau masuk² ke game. Alhasil jadi afk. Udh coba pakai wifi + data buat nonton yt 1080p lancar . Buat main game sampah ini mlh ngebug. Bikin player g nyaman begini. Ivent aj di ulang² mulu. liatnya bosen, Player old yg udh dapat skin limit malah di keluarin lg. Percuma. Fokus perbaiki sinyal terlebih dahulu. Jangan asal keluar hero baru\/ skin baru.","sentiment":"negatif","predict":"negatif"},{"text":"Match Making nya makin g jelas dan tidak fair karena di pertemukan dengan rank bawah dan sering terjadi lagging dan banyak team yg tidak ingin berkerja sama klo bisa Bermain rank nya di sama kan dengan win rate,Rank,kda,Permainan Mohon di perbaiki dan sering frame padahal sinyal bagus tpi masih lag dan frame Mohon di perbaiki ya","sentiment":"negatif","predict":"negatif"},{"text":"gimana ya, kalo patch sekarang gw bisa bilang oke semua hero imbang semua, cuman di matching up nya yg harus lu benerin masa iya gw sebintang lagi glory harus turun, gw maklumi kalo turun nya sebintang atau dua bintang ini mah ber puluh\" loh, jadi ga heran game lu dapet ulasan bintang satu terus, titipan gw : 1. benerin matching up nya, 2. sesuain tim nya jangan berat sebelah 3. hapus dark sistem","sentiment":"negatif","predict":"negatif"},{"text":"Woi moontoon...game lu tambah lama tambah aneh.. matchmaking tambah ga jelas..perbaiki game lu..kalo ga mau jadi game mati,sepi peminat, update Mulu..dapet team banyak yg ga jelas...,dengerin aspirasi player lain jangan hanya monoton denger aspirasi pro player aja kalo mau game lu berkembang ...inget itu...!!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"+ game menarik dan menantang untuk dipelajari + game seru - algoritma bobrok tidak sesuai keterangan yang tertulis - banyak bug - kompensasi bug sangat tidak sebanding - terlalu banyak iklan event yang mengganggu pada halaman awal masuk game - match making tidak seimbang - saat ingin melapor bug \/ komplain yang lain di dalam game sangat sulit dan ribet","sentiment":"negatif","predict":"negatif"},{"text":"Tolong dong hilangin drak sistem bkan aku aja sih yg hampir Gilak karna dark sistem ni, tolong dong yg bner² aja, kasih lawan yg sbnding, dn kasih tim yg jelas, stiap war jaringan di nglegin tolong dong hilangin drak sistem jngan pilih kasih, aku yg mantan glory stiap season. Mentok di biru truss, sesuaikan tim ketika main solo, trimakasih","sentiment":"positif","predict":"negatif"},{"text":"Moonton tolong di cek kembali tentang jaringan,soal nya jaringan saya bagus tpi saat ingin start ada peringatan tentang jaringan tidak stabil tolong di cek dan segerah di proses","sentiment":"netral","predict":"netral"},{"text":"Gua sebagai player lama kecewa di updatean sekarang,apa apa ngeframe apa apa ngeframe padahal ruang penyimpanan masihh banyak itu pun data MLbb GK saya download semuaa,tolong di perbaiki lahh secepatnya,yang tdinya saya mau menang gara gara frame atau GK bisa digerakin ke ngebeku gitu jdii berujung kalah kn,segera ditindak lanjuti!!!!!","sentiment":"netral","predict":"negatif"},{"text":"Tolong dong perbaiki dengan koneksi sinyal ,padahal sinyal saya bagus kenapa pas setiap ada musuh langsung ngga ada sinyal ,saya dari dulu main ngga kaya gini kenapa sekarang kaya gini bikin emosi saat main","sentiment":"positif","predict":"negatif"},{"text":"Update terus, revamp terus, skin terus ama perbanyak aja terus event nya binatang. Kapan perbaikan match nya di dibuat seimbang hah?????? Bagi yg mau download mending gk ush di download ini game. Percuma event banyak doang kalau keseimbangan match nya gk imbang Mikir lah","sentiment":"negatif","predict":"negatif"},{"text":"Karena dalam pembagian tim tidak sama rata, dan banyak anak dibawah umur yang bermain padahal game ini sangat tidak cocok untuk umur dibawah 17th, sering terjadi bug sehingga menyulitkan pemain saat bermain, banyak kesalahan penafsiran kata pada bot yang seharusnya bukan kata kasar menjadi kata kata sensitif, saya harap lebih teliti dan untuk registrasi data lebih diperketat lagi agar anak dibawah umur tidak bermain game ini, seharusnya jika banyak keluhan maka harus lebih ditingkatkan lagi","sentiment":"negatif","predict":"negatif"},{"text":"Akhir akhir ini dapet tim dark system dan ngelag, lag nya itu pas di war sama mau ke tower musuh aja, padahal jaringan wifi kenceng, good bye mobile legend, Terima kasih 5 tahun nya","sentiment":"positif","predict":"negatif"},{"text":"Semua game aman aman aja tapi yang jadi masalah sistem draftpick nya ga sesuai sama tier\/pangkat kita dan semakin lama saat ini montoon makin tidak jelas.","sentiment":"negatif","predict":"negatif"},{"text":"Moonton tolong lah, kalau sudah tosoon itu dikasih menang sekali kek, bukannya dikasih lawan yang lebih susah lagi Ditambah lagi pas dah win streak 3-5 kali, habis itu malah dikasih dark sistem, kan kita sebagai solo player ga bisa berbuat banyak alhasil ya tusunn","sentiment":"positif","predict":"negatif"},{"text":"Apaan sih pas lagi match jaringan tiba tiba hilang terus padahal pake wifi pribadi, sering terjadi apalagi kalo rank, ujung2ny jadi beban ke tim alhasil harus afk","sentiment":"negatif","predict":"negatif"},{"text":"Untuk sistem drafpick dan bug lainnya sudah bagus dan di atasi tapi sistem sensor sangat menggangu komunikasi dengan team dan selalu **** **** **** membuat team jadi sulit berkomunikasi dan juga sistem mute wajar ketika orang berkata kasar kalo mendapatkan team yang tidak serius, hanya berkata (beban, tidak berguna) apa itu sangat sensitif? Dan juga meta tidak seimbang dyrrot Valentina, yang memiliki damage besar dari early game sampai late game, pokoknya saya sangat kecewa :), thx","sentiment":"negatif","predict":"negatif"},{"text":"Ping sangat tidak stabil selama pertandingan, padahal sinyal bagus. Ping naik turun parah, Wifi atau data seluler hasilnya sama. Padahal di pake untuk nonton Youtube atau aplikasi lain lancar, tapi main ML malah parah. Ayodong, kapan mau di beresin Servernya, masa main di jam prime time, setiap jam 18.00 - 23.00 ping gak stabil, masa harus main tengah malem terus?","sentiment":"positif","predict":"negatif"},{"text":"Gunakan skill atau apapun waktu main pasti mencet lebih 2X kurang 2X gak bisa di pencet. Ini bug atau gimana, tolong perbaiki. Terima kasih","sentiment":"positif","predict":"negatif"},{"text":"Sering terkendala jaringan, malah di anggap afk, mohon diperbaiki lagi untuk penilaian terhadap player Penilaian moonton terhadap afk yang disebabkan hilangnya jaringan masih belum teliti, saya merasa dirugikan akibat penilaian tersebut dan sepertinya lebih baik mengalah dengan menghapus aplikasi game ini","sentiment":"negatif","predict":"negatif"},{"text":"Makin Lama Makin update game ini tambah rusak banyak sekali bug² di game ini ketika saya saat bermain yaitu 1.suara notif kill tiba²hilang sendiri 2.mengirim ping merah ke teman satu tim ketika saya lag jumping yg muncul ping hijau terus 3.dpt tim gk jelas 4.saya ingin menanti ini game bakalan sepi...","sentiment":"negatif","predict":"negatif"},{"text":"Sebelumny ku kasih bintang 5, sekarang ku turunin bintang 1. Jaringan bagus, main d game lain lancar2 aja, cuma main d ML jaringan sangat2 buruk. Game yg tidal recomend... Mending main d sebelah jaringan lebih stabil. Sdh banyak teman2 uninstal game ini ku ajak main d game sebelah.","sentiment":"negatif","predict":"negatif"},{"text":"Kasih tim buat solo player berasa 9 vs 1 ,bukan 5 vs 5, dan tololnya lagi game ini sering dapat tim yang troll dan merugikan kami yang udh pro dalam game, game moba terbaik masih DOTA DAN AOV yang terbaik gk ada namanya orang push solo dipersulit,apa lagi sering ketemu akun joki jadi merugikan buat solo player","sentiment":"negatif","predict":"negatif"},{"text":"Gue lama lama pengin hapus game ini karena game ini sangat tidak jelas suka keluar sendiri padahal WiFi Saya sudah bagus sinyalnya. menghung kembali nya lama bisa sampai 1jam tapi nunggu nya tau tau udh selesai sumpah ini game buat biar GK stres malah tambah stress tolong perbaiki monton Terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Game tolol, ketemu org bdh terus menerus, matchmaking tidak pernah seimbang, sekali lagi dasar game bdh, skill musuh selalu diatas skill tim saya, ini game 5v5, bukan 1v5, jika bukan karena waktu luang yang membosankan, saya tidak akan bermain game sampah ini, MATCHMAKING TOLONG DIBUAT SEIMBANG, Moonton","sentiment":"negatif","predict":"negatif"},{"text":"Dah waktunya pensiun main ML gak si ? Ganti game lain yang lebih fresh, ntah ngapa Mobile legend makin kesini makin aneh. Skin emang makin bagus\" tapi sistem buat pembagian tim nya makin absurd bikin emosi sama stres sendiri, main lagi serius\" nya malah dikasih tim gak jelas kan jadinya gak imbang, malah bikin musuh menang dengan mudah. Giliran gw sendiri stress ngecarry orang\" gak jelas, buat apa skin makin bagus klo sistem pembagian tim nya begini, masa harus lose 4 kali dlu buat menang aneh.","sentiment":"negatif","predict":"negatif"},{"text":"Ketika permainan lagi seru,,, selalu muncul lag,,,, padahal data jaringan 4G,,, di dobel pake Wi-Fi,,, tetap aja timbul lag,,,,jadi males dan terkadang emosi klo lagi seru maen timbul lag,,,","sentiment":"netral","predict":"negatif"},{"text":"Saya kasih bintang 1 karena game ini selalu membuat saya dapat tim gk tau main sama kadang kadang mau lag. saya menyarankan jika saya main ingin dapat teman tau main agar saya bisa kasih game ini bintang 5 udah lah tim bbn gk jls keras kepala lagi di bilangi","sentiment":"negatif","predict":"negatif"},{"text":"Moonton gak adill banget kalo ngasih tim, selalu dapet tim bott(player pemula) sedangkan musuh nya pro player semuaa plisslah diperbaiki lagi supaya timnya imbang.setelah update bukannya lebih baik malah burukkk.Banyak bugg saat login kadang gak bisa login padahal jaringan saya normal² aja","sentiment":"netral","predict":"negatif"},{"text":"Menurut saya dari kebanyakan game, cuman game ini yang pembuat pemainnya jadi stres, karena apa? Karena pemain di kasih sbuah kelompok yang dak bisa bermain dengan bagus, dan juga dikasih lose treak sebanyak-banyaknya, jadi ini lah game perusak rohani orang, karena pemainnya dibuat stress karena mendapat random player yang dak bisa main ml","sentiment":"negatif","predict":"negatif"},{"text":"Saya sangat sangat emosi ketika lg wor tiba tiba sinyal memburuk tapi untuk aplikasi yg lain normal dan kadang kadang langsung keluar sendiri untuk masuknya lama... Jadi afk lah itu mutlak kesalahan sistemnya.... Tolong di perbaiki kembali.... Biar lancar bermain nambah enak..... Husus HP Ram 2gb","sentiment":"positif","predict":"negatif"},{"text":"Sinyal jelek mulu dan disarankan pada saat main rank dan kalah gara gara sinyal bintang nya jangan di kurangin dan bukan itu saja pada saat saya bermain tolong saya jangan di satukan sama player yang tidak bisa bermain,buta mapp ngefeed Mulu:(, dan bukan itu saja yg bikin saya kesal di saat sinyal saya jelek saya jadi susah main dan mati terus dan banyak player yg ripoet saya padahal karna sinyal nya jelek jadi hilang kredit skor nya:( game taiii💩💩💩💩💩💩💩💩💩💩💩💩💩💩","sentiment":"negatif","predict":"negatif"},{"text":"Game paling parah saat ini,,, masa jaringan bagus pingnya dibikin merah terus agar lag dalam permainan ini memang disengaja monton agar rank tidak naik, laporan tidak ada tanggapan jadi auto delete karena semakin tidak memuaskan lagi, bosan main di sini montonnya tidak adil.","sentiment":"negatif","predict":"negatif"},{"text":"Lu liat bukan cuma masalah performa gamenya tapi juga mactmaking dalam game bermasalah,tim tidak seimbang,kalah menang sudah di atur oleh moonton,mohon baca para player ml agar ini game cepat bangkrut","sentiment":"negatif","predict":"negatif"},{"text":"game banyak bug ga jelas, makin di update makin aneh, jaringan lancar malah jumping sendri, main solo mala ketemu tim bot smua (computer) ga jelas emang perbaiki lah bugnya","sentiment":"negatif","predict":"negatif"},{"text":"Sering force close, bukan cmn gua tmn tmn gua jg banyak. Untuk spesifikasi hp gk kentang\" amat, rata\" pakai realme 8 ke atas \/hp dengan prosesor yang lmayan bagus sd666 keatas ram jg gk ada yang kecil, roam jg sisa bnyak bahkan punya gua masih sisa 100gb sering fc. Awalnya ku kira karna ada data eror tpi udah instail ulang bahkan reset data pabrik jg masih sama aja","sentiment":"netral","predict":"negatif"},{"text":"Saya berharap kepada moonton berikan saya musuh seimbang bukan yg pro\/jago ya itu saja, saya bosan defeat terus semoga di perbaiki agar semua player mau memainkan game ini ya, kalau GK di perbaiki ya saya unistal aja ya moonton 😥😥😥","sentiment":"negatif","predict":"negatif"},{"text":"Kangen mobile legends yang dulu, masa sekarang main relog Mulu, udah rusak ni game buat hp ram 3, kolo bisa di buat ngak relog lagi gue kasih bintang 5 dah,siapa yang setuju Ama gue, salin komen yang sama kayak gue agar di atasi, sekian semoga di baca.","sentiment":"negatif","predict":"negatif"},{"text":"Buat teman2 player, mohon ngrti aj masalahnya. Kita sering dapat lawan yg tidak seimbang, krn semuanya di atur oleh sistem moonton sndri. Menang klh itu sudah di tentukan moonton.","sentiment":"netral","predict":"negatif"},{"text":"Sebenernya bgus iini. Tapi itu kenapa ga bisa di berhenti donwlod data nya .plis lah untuk monton tolong d ufdate lagi .kami rakyat kecil ga punya banyak kouta untuk itu .tolongg bangett.","sentiment":"netral","predict":"negatif"},{"text":"Game ini bnyak yng tidak imbang contohnya skil panny itu sama sekali tidak imbang dengan skill hero yng lain karna sulit untuk dikill disebabkan skill yng gk mungkin di ulti dan masih bnyak hero2 seperti ini... Pendapat saya game ini.. Game terburuk yng saya mainkan...","sentiment":"negatif","predict":"negatif"},{"text":"sekarang adanya tambahan fitur manajemen resource malah makin ribet ( susah),malah gabisa maen offline mod dan mendownloadtan datanya tidak semua padahal sudah di setting ke unduh semua, potret skin. Hd tidak bisa didownload.tolong moonton diperbaiki secepat mungkin,besok harus sudah update terimakasih","sentiment":"positif","predict":"netral"},{"text":"Game apa ini main ja di kasih tim bot Mulu cuma mau naik kemitik kurang 1 bintang ja malah di turunin dikasih tim bot Mulu tolonglah niat bikin game gak sih paling gak ya di kasih tim yang seimbang jangan berat sebelah tolong ya monton yang bener kalau kasih tim, lama lama bisa stres main game ini kalau kayak gini terus ini game bukanya ngilangin stres malah tambah bikin orang tambah stres gara gara mainin game ini","sentiment":"negatif","predict":"negatif"},{"text":"Game kalo makin update makin banyak ngebug salah satunya adalah game MOBA INI mengapa saya sudah download data hingga sudah tidak ada data yang harus di download lagi tapi kok bisa bisanya heronya masih pada bentuk bulat seperti kelereng kan padahal saya sudah download data sudah update kenapa heronya jadi seperti kelereng. TOLONG DIPERBAIKI","sentiment":"negatif","predict":"negatif"},{"text":"Tidak ada game yg menyerukan selain game ini, mobile legend bangbang. Kurang lebih sudah 5 tahun saya memainkan nya, hanya saja belakangan ini mengapa jaringan suka tiba2 merah dan bikin Hero gabisa gerak, seolah jadi kaya org lgi bljar Hero, kebanyakan update cuman buat data hp ku jadi penuh, apalagi android evercoos ram3\/32 hadeh, pdhal dulu hp Andro biasa ram di bawah 2 aj maen gada kendala seperti lag2 gajelas, sering patah2, membuat org yg memainkan bukan nya happy justru malah bikin emosi.","sentiment":"netral","predict":"negatif"},{"text":"Game bikin stres, yang belum install saya harap nggak usah install si, awal2 masih menghibur , lama kelamaan pasti di bikin emosi dengan sistemnya,. Apa yang di dapet ketika mendapatkan lose streak\/kalah berturut-turut : emosi, stress, kesel dan bikin nyesel. Bukan karena mainya, tp karena sistemnya. Game untuk hiburan bukan untuk bikin stress penggunanya.","sentiment":"negatif","predict":"negatif"},{"text":"Ini game nya rusak atau apa ya,,, dari jam 11 pagi tadi disuruh update untuk event baru ,tapi setelah di update malah ga bisa login ,\"login eror\" , gw udh coba berkali\" login ,sapi restart,, dan udh 4 kali uninstall dan update lagi, tapi tetap aja sama ga bisa login ( login eror) ,,,, ini gimana ???","sentiment":"negatif","predict":"negatif"},{"text":"Gamenya kurang bagus karena 1.mode offline tidak bisa dimainkan saat menghapus download ulang game 2.tentang sinyal kalo sinyal buruk itu proteksien nya cuma 100 padahal kalah itu karena sinyal nya buruk, dibandingkan dengan game lain kalo sinyal buruk itu bintang nya tetap tidak berkurang 3.kenapa saya tidak mendapatkan bintang setelah memenangkan pertandingan di mode rank alasan:karena pelanggaran chat ,padahal saya hanya mengetik \"jawab\" Dikira pelanggaran mending uninstall aja!","sentiment":"negatif","predict":"negatif"},{"text":"di hp ram 2 saat war tidak bisa di kontrol, semacam kaya orang afk, padah sinyal bagus, tqpi koj tidak bisa kontrol, tooon moontooon update bukanya bagus malah memperparah nyesel sih saya update, sebelum update, tidak ada kendala apa apa, setelah di update, kok nambah paraaaah","sentiment":"netral","predict":"negatif"},{"text":"Moonton! Perbaiki masalah ping yang sering jumping, sudah banyak player yang mengeluh tentang ini. Di youtube, facebook, bahkan dalam game banyak yg mengeluh tentang ping yang tiba tiba naik hingga 200ms+.","sentiment":"negatif","predict":"negatif"},{"text":"Loading file error ini knp? Udah lumayan lama lo ya jd player setia ml jgn gegara loading file eror gue pindah ke game sebelah. Gua download ya dr sini, klo ada masalah tolong di fix kan. Dan kalo ini ulah cheater tolong di musnahkan. Makasih","sentiment":"negatif","predict":"negatif"},{"text":"Kacau. Pertandingan banyak yang gak seimbang. Tim sendiri bego, tim lawan jago. Minimal seimbang. Perbaiki lagi utk pembagian tim. Berdasarkan Riwayat gameplay nya.","sentiment":"negatif","predict":"negatif"},{"text":"Game nya bagus. Kadang punya tim bagus, kadang nob Kadang winstreak kadang lose treak, tapi kebanyakan lose streak nya dari pada menang nya sehingga membuat saya tidak nyaman. Mohon kebijakan nya untuk memberi keadilan player\" yang lagi solo rank.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah coba match making nya tu di benerin masa dapat tim gak jelas terus gak seimbang lagi musuh nya jago tapi dapat tim nya jelek kayak apa mau menang pas masih warrior sampai GM mah biasa aja kalo habis mytic kena reset season ke epic kok susah betul dapat tim yang pro sedangkan kalo musunya jago terus, plis moonton kasih lah tim yang dapat di andalkan dan sesekali kasih musuh yang noob","sentiment":"positif","predict":"negatif"},{"text":"Jaringan bagus tapi gamenya makin ngelag ga karuan dan moontod udah terlalu mementingkan uang daripada keseimbangan dan keseruan para player jadi selalu dapet team yang ga seimbang demi orang-orang yang bayar untuk konten nya Ga SE seru dulu","sentiment":"netral","predict":"negatif"},{"text":"Semenjak di update jaringan tiba tiba ngeleg sendiri padahal dulu ketika main stabil di 8-9 ms,sekarang jadi tiba tiba berubah ke 285 ms,dan itu sering terjadi paling gk enak ketika war tiba tiba ngeleg","sentiment":"positif","predict":"negatif"},{"text":"Selalu saja ketika sedang berperang sinyal tiba-tiba merah dan ketika sudah mati baru sinyalnya bagus kembali padahal lokasi saya bermain sinyalnya aman saja. Sudah sejak 2018 saya bermain game ini dan belum pernah sekecewa ini. Masih banyak lagi masalah yang lain seperti bug pada hero dan keseimbangan tier dlm permainan. Masa solo dimitik msih dpat teman legend yg digendong. Dan musuh malah udah glori smua.😌","sentiment":"negatif","predict":"negatif"},{"text":"Dark sistem terusss,kenapa setiap main lawan saya selalu bermain bagus sedangkan tim saya selalu bermain buruk??kalau dikasih dark sistem terusss kapan naik rank nya????","sentiment":"negatif","predict":"negatif"},{"text":"Dari segi grafis udah manteb, tapi pas pertandingan suka banget frame rate crash lag ping 285 yah jadi auto AFK padahal gw udah pake 2 jaringan 4G dan wifi lancar. Udah pake game booster jga sma. Ah gila.","sentiment":"negatif","predict":"negatif"},{"text":"gamenya ps sblm update udh bagus,tapi pas d update sering bgt lag+jaringan merah pdhl internet bagus kok,trs tim juga g seimbang bgt sama tim musuh,trs skrng kalau main d rank atas ps draft pick g ada map yg ad lane ny,trs ps lagi main tiba²ktnya menunggu jaringan mohon diperbaiki ya montoon,kalau msh kek gini ml bkl sepi pemain :(","sentiment":"negatif","predict":"negatif"},{"text":"Game cukup seru untuk dimainkan apalagi dengan teman-teman, tapi ada yang satu bikin kesel saat bermain yaitu 1. Koneksi yang tidak stabil 2. Flicker tidak berefek pada musuh yang melakukan montage 3. Lawan yang tidak seimbang. Demi kenyamanan semua player tolong diperbaiki secepatnya","sentiment":"negatif","predict":"negatif"},{"text":"Setiap update patch yg dilakukan selalu memberikan ketidak nyamanan dalam bermain..pembagian team match yg tdk seimbang dan pengaturan emblem yg baru malah membuat permainan jadi tdk menarik sebab terlalu rumit dan pengaturan tdk sesuai yg diinginkan oleh setiap pemain ...mobile legend sangat tdk fair dan tdk bagus dlm setiap update terbarunya sebab banyak merugikan para player dan anda tdk mempertimbangkan kenyamanan para player ..sangat buruk","sentiment":"positif","predict":"negatif"},{"text":"Masalah Kembali Lagi, Pakai Data Selalu Ping nya sangat Tinggi, 100 -200 ms an, padahal posisi sinyal full bar buat download tembus 1mb+, udh aktifin mode speed masih gak terlalu ngefek malah jadi naik turun ga karuan, udh coba ganti provider sinyal ttp sama aja","sentiment":"positif","predict":"negatif"},{"text":"Sistem penilaian akhir macth yang aneh. KDa bagus dan memadai serta statistik yang bagus tapi medal yang di dapat selalu Di bawah Gold\/Mvp. Jika medal tergantung dari asist maka akan butuh banyak asist agar medal gold\/mvp serta jika tidak ada asist sudah di pastikan tidak mendapat Mvp\/gold","sentiment":"netral","predict":"negatif"},{"text":"Game buruk Sistem marching tidak seimbang, selalu dipasangkan dengan tim yang lemah dan musuh yang terlalu kuat. Dari sistem moonton harus dihapus. Ini game adiktif yang membuat anak kecil kecanduan dan berdampak buruk bagi mental anak","sentiment":"negatif","predict":"negatif"},{"text":"Jangan kebanyakan uodate lah montoon.. Coba si di sesuaikan update.a jangan dikit2 update dikit2 update.. Herro baru pun belom dpt sudah update baru lg. Satu lagi terlalu banyak bug jaringan jadi gk stabil. Bikin emosi.","sentiment":"netral","predict":"negatif"},{"text":"Buat moonton untuk update yang terbaru ini tolong diperbaiki masalah sinyal saat didalam game yang naik turun,yang dari ping 30ms tiba tiba jadi 200ms. Padahal sinyal internet aku bagus,dan waktu dilobi pingnya juga bagus 30ms,tapi ketika didalam game jadi tidak karuan pingnya. Jadi buat moonton tolong diperbaiki secepatnya 🙏.","sentiment":"negatif","predict":"negatif"},{"text":"semakin berat dan berat. relog bentar gabisa balik in game harus nunggu 3 menit padahal jaringan stabil. alhasil afk deh. update skill hero yg gaperlu perlu amat. mending taruh di mini gamesnya aja. kalo bisa offline ehh tapi ga cuan yaa wkwkwk. skin hero lama masih banyak yg sedikit yg diupdate hero hero itu mulu. ga peduli juga ama hero hero baru malah bikin berat sistem. pas update pun desainnya malah dibikin minimalis jelek banget.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong perbaiki masalah jaringannya,, saya pake os & ios sama aja selalu pin nya merah terus heran juga kenapa saya dan tim saya yang lag sementara tim musuh ngga ada yang lag Tolong yah moonton jngan skin saja yang difokusi,, TAIIIII !!!!!!","sentiment":"netral","predict":"negatif"},{"text":"Semakin kesisni mlbb moonton makin parah.!!!!!!! Nggk clasic nggak juga rank samaaja membosankan Suka lag,tiba2 jaringan ngilang coba.!!!!!! Tolong dong sistemnya diperbaiki","sentiment":"negatif","predict":"negatif"},{"text":"Kesal. Kok tiba tiba keluar sendiri? Ada apa moonton... malah aku yg di baned sama tim sendiri. Game kebannyakan problem selalu stag kalau ngk server jaringan game yg buruk. PARAHHHHH saya tambain lagi. Drak sistem ini game makin buruk. Makin jelek dari game game vs.","sentiment":"negatif","predict":"negatif"},{"text":"Mobile legend sekarang. Semakin buruk. Dikarnakan Bug Sinyal dan matcmaking error. Tolong. Data tidak usah di perbesar moonton.kasihani lah player ram2 yang bermain game ini. Grafis si hd. Tpi tolonglah perbaiki kesalahannya. Saya dapat kredit skors rendah. Dan gk bisa main rank. Di karenakan masalah.bug dan matmaking. Kata dari saya, Semakin update semakin buruk","sentiment":"negatif","predict":"negatif"},{"text":"Buruk, tiba² hero jadi bola², bikin ga nyaman. Mobile Legend, tidak layak dimainkan. Gara2 lu bikin bola², gue kalah sampe 11 bintang. WOIIIIII MOONTONNNNNN !!!!!","sentiment":"netral","predict":"negatif"},{"text":"Untuk game sudah oke tapi kendalanya jaringan harus benar-benar cepat\/tinggi bermain game untuk hiburan tapi setelah memainkan game ini emosi lag terus menerus harus kah HD nya semua mode off catatan penting akan banyak pemain yang akan beralih dari game ini","sentiment":"negatif","predict":"negatif"}]